RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl702/std/include/hardware/glb_reg.h
/* 0x130 : GPIO_CFGCTL12 */
#define GLB_GPIO_CFGCTL12_OFFSET      (0x130)
#define GLB_REG_GPIO_24_IE            GLB_REG_GPIO_24_IE
#define GLB_REG_GPIO_24_IE_POS        (0U)
#define GLB_REG_GPIO_24_IE_LEN        (1U)
#define GLB_REG_GPIO_24_IE_MSK        (((1U << GLB_REG_GPIO_24_IE_LEN) - 1) << GLB_REG_GPIO_24_IE_POS)
#define GLB_REG_GPIO_24_IE_UMSK       (~(((1U << GLB_REG_GPIO_24_IE_LEN) - 1) << GLB_REG_GPIO_24_IE_POS))
#define GLB_REG_GPIO_24_SMT           GLB_REG_GPIO_24_SMT
#define GLB_REG_GPIO_24_SMT_POS       (1U)
#define GLB_REG_GPIO_24_SMT_LEN       (1U)
#define GLB_REG_GPIO_24_SMT_MSK       (((1U << GLB_REG_GPIO_24_SMT_LEN) - 1) << GLB_REG_GPIO_24_SMT_POS)
#define GLB_REG_GPIO_24_SMT_UMSK      (~(((1U << GLB_REG_GPIO_24_SMT_LEN) - 1) << GLB_REG_GPIO_24_SMT_POS))
#define GLB_REG_GPIO_24_DRV           GLB_REG_GPIO_24_DRV
#define GLB_REG_GPIO_24_DRV_POS       (2U)
#define GLB_REG_GPIO_24_DRV_LEN       (2U)
#define GLB_REG_GPIO_24_DRV_MSK       (((1U << GLB_REG_GPIO_24_DRV_LEN) - 1) << GLB_REG_GPIO_24_DRV_POS)
#define GLB_REG_GPIO_24_DRV_UMSK      (~(((1U << GLB_REG_GPIO_24_DRV_LEN) - 1) << GLB_REG_GPIO_24_DRV_POS))
#define GLB_REG_GPIO_24_PU            GLB_REG_GPIO_24_PU
#define GLB_REG_GPIO_24_PU_POS        (4U)
#define GLB_REG_GPIO_24_PU_LEN        (1U)
#define GLB_REG_GPIO_24_PU_MSK        (((1U << GLB_REG_GPIO_24_PU_LEN) - 1) << GLB_REG_GPIO_24_PU_POS)
#define GLB_REG_GPIO_24_PU_UMSK       (~(((1U << GLB_REG_GPIO_24_PU_LEN) - 1) << GLB_REG_GPIO_24_PU_POS))
#define GLB_REG_GPIO_24_PD            GLB_REG_GPIO_24_PD
#define GLB_REG_GPIO_24_PD_POS        (5U)
#define GLB_REG_GPIO_24_PD_LEN        (1U)
#define GLB_REG_GPIO_24_PD_MSK        (((1U << GLB_REG_GPIO_24_PD_LEN) - 1) << GLB_REG_GPIO_24_PD_POS)
#define GLB_REG_GPIO_24_PD_UMSK       (~(((1U << GLB_REG_GPIO_24_PD_LEN) - 1) << GLB_REG_GPIO_24_PD_POS))
#define GLB_REG_GPIO_24_FUNC_SEL      GLB_REG_GPIO_24_FUNC_SEL
#define GLB_REG_GPIO_24_FUNC_SEL_POS  (8U)
#define GLB_REG_GPIO_24_FUNC_SEL_LEN  (5U)
#define GLB_REG_GPIO_24_FUNC_SEL_MSK  (((1U << GLB_REG_GPIO_24_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_24_FUNC_SEL_POS)
#define GLB_REG_GPIO_24_FUNC_SEL_UMSK (~(((1U << GLB_REG_GPIO_24_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_24_FUNC_SEL_POS))
#define GLB_REG_GPIO_25_IE            GLB_REG_GPIO_25_IE
#define GLB_REG_GPIO_25_IE_POS        (16U)
#define GLB_REG_GPIO_25_IE_LEN        (1U)
#define GLB_REG_GPIO_25_IE_MSK        (((1U << GLB_REG_GPIO_25_IE_LEN) - 1) << GLB_REG_GPIO_25_IE_POS)
#define GLB_REG_GPIO_25_IE_UMSK       (~(((1U << GLB_REG_GPIO_25_IE_LEN) - 1) << GLB_REG_GPIO_25_IE_POS))
#define GLB_REG_GPIO_25_SMT           GLB_REG_GPIO_25_SMT
#define GLB_REG_GPIO_25_SMT_POS       (17U)
#define GLB_REG_GPIO_25_SMT_LEN       (1U)
#define GLB_REG_GPIO_25_SMT_MSK       (((1U << GLB_REG_GPIO_25_SMT_LEN) - 1) << GLB_REG_GPIO_25_SMT_POS)
#define GLB_REG_GPIO_25_SMT_UMSK      (~(((1U << GLB_REG_GPIO_25_SMT_LEN) - 1) << GLB_REG_GPIO_25_SMT_POS))
#define GLB_REG_GPIO_25_DRV           GLB_REG_GPIO_25_DRV
#define GLB_REG_GPIO_25_DRV_POS       (18U)
#define GLB_REG_GPIO_25_DRV_LEN       (2U)
#define GLB_REG_GPIO_25_DRV_MSK       (((1U << GLB_REG_GPIO_25_DRV_LEN) - 1) << GLB_REG_GPIO_25_DRV_POS)
#define GLB_REG_GPIO_25_DRV_UMSK      (~(((1U << GLB_REG_GPIO_25_DRV_LEN) - 1) << GLB_REG_GPIO_25_DRV_POS))
#define GLB_REG_GPIO_25_PU            GLB_REG_GPIO_25_PU
#define GLB_REG_GPIO_25_PU_POS        (20U)
#define GLB_REG_GPIO_25_PU_LEN        (1U)
#define GLB_REG_GPIO_25_PU_MSK        (((1U << GLB_REG_GPIO_25_PU_LEN) - 1) << GLB_REG_GPIO_25_PU_POS)
#define GLB_REG_GPIO_25_PU_UMSK       (~(((1U << GLB_REG_GPIO_25_PU_LEN) - 1) << GLB_REG_GPIO_25_PU_POS))
#define GLB_REG_GPIO_25_PD            GLB_REG_GPIO_25_PD
#define GLB_REG_GPIO_25_PD_POS        (21U)
#define GLB_REG_GPIO_25_PD_LEN        (1U)
#define GLB_REG_GPIO_25_PD_MSK        (((1U << GLB_REG_GPIO_25_PD_LEN) - 1) << GLB_REG_GPIO_25_PD_POS)
#define GLB_REG_GPIO_25_PD_UMSK       (~(((1U << GLB_REG_GPIO_25_PD_LEN) - 1) << GLB_REG_GPIO_25_PD_POS))
#define GLB_REG_GPIO_25_FUNC_SEL      GLB_REG_GPIO_25_FUNC_SEL
#define GLB_REG_GPIO_25_FUNC_SEL_POS  (24U)
#define GLB_REG_GPIO_25_FUNC_SEL_LEN  (5U)
#define GLB_REG_GPIO_25_FUNC_SEL_MSK  (((1U << GLB_REG_GPIO_25_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_25_FUNC_SEL_POS)
#define GLB_REG_GPIO_25_FUNC_SEL_UMSK (~(((1U << GLB_REG_GPIO_25_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_25_FUNC_SEL_POS))

/* 0x134 : GPIO_CFGCTL13 */
#define GLB_GPIO_CFGCTL13_OFFSET      (0x134)
#define GLB_REG_GPIO_26_IE            GLB_REG_GPIO_26_IE
#define GLB_REG_GPIO_26_IE_POS        (0U)
#define GLB_REG_GPIO_26_IE_LEN        (1U)
#define GLB_REG_GPIO_26_IE_MSK        (((1U << GLB_REG_GPIO_26_IE_LEN) - 1) << GLB_REG_GPIO_26_IE_POS)
#define GLB_REG_GPIO_26_IE_UMSK       (~(((1U << GLB_REG_GPIO_26_IE_LEN) - 1) << GLB_REG_GPIO_26_IE_POS))
#define GLB_REG_GPIO_26_SMT           GLB_REG_GPIO_26_SMT
#define GLB_REG_GPIO_26_SMT_POS       (1U)
#define GLB_REG_GPIO_26_SMT_LEN       (1U)
#define GLB_REG_GPIO_26_SMT_MSK       (((1U << GLB_REG_GPIO_26_SMT_LEN) - 1) << GLB_REG_GPIO_26_SMT_POS)
#define GLB_REG_GPIO_26_SMT_UMSK      (~(((1U << GLB_REG_GPIO_26_SMT_LEN) - 1) << GLB_REG_GPIO_26_SMT_POS))
#define GLB_REG_GPIO_26_DRV           GLB_REG_GPIO_26_DRV
#define GLB_REG_GPIO_26_DRV_POS       (2U)
#define GLB_REG_GPIO_26_DRV_LEN       (2U)
#define GLB_REG_GPIO_26_DRV_MSK       (((1U << GLB_REG_GPIO_26_DRV_LEN) - 1) << GLB_REG_GPIO_26_DRV_POS)
#define GLB_REG_GPIO_26_DRV_UMSK      (~(((1U << GLB_REG_GPIO_26_DRV_LEN) - 1) << GLB_REG_GPIO_26_DRV_POS))
#define GLB_REG_GPIO_26_PU            GLB_REG_GPIO_26_PU
#define GLB_REG_GPIO_26_PU_POS        (4U)
#define GLB_REG_GPIO_26_PU_LEN        (1U)
#define GLB_REG_GPIO_26_PU_MSK        (((1U << GLB_REG_GPIO_26_PU_LEN) - 1) << GLB_REG_GPIO_26_PU_POS)
#define GLB_REG_GPIO_26_PU_UMSK       (~(((1U << GLB_REG_GPIO_26_PU_LEN) - 1) << GLB_REG_GPIO_26_PU_POS))
#define GLB_REG_GPIO_26_PD            GLB_REG_GPIO_26_PD
#define GLB_REG_GPIO_26_PD_POS        (5U)
#define GLB_REG_GPIO_26_PD_LEN        (1U)
#define GLB_REG_GPIO_26_PD_MSK        (((1U << GLB_REG_GPIO_26_PD_LEN) - 1) << GLB_REG_GPIO_26_PD_POS)
#define GLB_REG_GPIO_26_PD_UMSK       (~(((1U << GLB_REG_GPIO_26_PD_LEN) - 1) << GLB_REG_GPIO_26_PD_POS))
#define GLB_REG_GPIO_26_FUNC_SEL      GLB_REG_GPIO_26_FUNC_SEL
#define GLB_REG_GPIO_26_FUNC_SEL_POS  (8U)
#define GLB_REG_GPIO_26_FUNC_SEL_LEN  (5U)
#define GLB_REG_GPIO_26_FUNC_SEL_MSK  (((1U << GLB_REG_GPIO_26_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_26_FUNC_SEL_POS)
#define GLB_REG_GPIO_26_FUNC_SEL_UMSK (~(((1U << GLB_REG_GPIO_26_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_26_FUNC_SEL_POS))
#define GLB_REG_GPIO_27_IE            GLB_REG_GPIO_27_IE
#define GLB_REG_GPIO_27_IE_POS        (16U)
#define GLB_REG_GPIO_27_IE_LEN        (1U)
#define GLB_REG_GPIO_27_IE_MSK        (((1U << GLB_REG_GPIO_27_IE_LEN) - 1) << GLB_REG_GPIO_27_IE_POS)
#define GLB_REG_GPIO_27_IE_UMSK       (~(((1U << GLB_REG_GPIO_27_IE_LEN) - 1) << GLB_REG_GPIO_27_IE_POS))
#define GLB_REG_GPIO_27_SMT           GLB_REG_GPIO_27_SMT
#define GLB_REG_GPIO_27_SMT_POS       (17U)
#define GLB_REG_GPIO_27_SMT_LEN       (1U)
#define GLB_REG_GPIO_27_SMT_MSK       (((1U << GLB_REG_GPIO_27_SMT_LEN) - 1) << GLB_REG_GPIO_27_SMT_POS)
#define GLB_REG_GPIO_27_SMT_UMSK      (~(((1U << GLB_REG_GPIO_27_SMT_LEN) - 1) << GLB_REG_GPIO_27_SMT_POS))
#define GLB_REG_GPIO_27_DRV           GLB_REG_GPIO_27_DRV
#define GLB_REG_GPIO_27_DRV_POS       (18U)
#define GLB_REG_GPIO_27_DRV_LEN       (2U)
#define GLB_REG_GPIO_27_DRV_MSK       (((1U << GLB_REG_GPIO_27_DRV_LEN) - 1) << GLB_REG_GPIO_27_DRV_POS)
#define GLB_REG_GPIO_27_DRV_UMSK      (~(((1U << GLB_REG_GPIO_27_DRV_LEN) - 1) << GLB_REG_GPIO_27_DRV_POS))
#define GLB_REG_GPIO_27_PU            GLB_REG_GPIO_27_PU
#define GLB_REG_GPIO_27_PU_POS        (20U)
#define GLB_REG_GPIO_27_PU_LEN        (1U)
#define GLB_REG_GPIO_27_PU_MSK        (((1U << GLB_REG_GPIO_27_PU_LEN) - 1) << GLB_REG_GPIO_27_PU_POS)
#define GLB_REG_GPIO_27_PU_UMSK       (~(((1U << GLB_REG_GPIO_27_PU_LEN) - 1) << GLB_REG_GPIO_27_PU_POS))
#define GLB_REG_GPIO_27_PD            GLB_REG_GPIO_27_PD
#define GLB_REG_GPIO_27_PD_POS        (21U)
#define GLB_REG_GPIO_27_PD_LEN        (1U)
#define GLB_REG_GPIO_27_PD_MSK        (((1U << GLB_REG_GPIO_27_PD_LEN) - 1) << GLB_REG_GPIO_27_PD_POS)
#define GLB_REG_GPIO_27_PD_UMSK       (~(((1U << GLB_REG_GPIO_27_PD_LEN) - 1) << GLB_REG_GPIO_27_PD_POS))
#define GLB_REG_GPIO_27_FUNC_SEL      GLB_REG_GPIO_27_FUNC_SEL
#define GLB_REG_GPIO_27_FUNC_SEL_POS  (24U)
#define GLB_REG_GPIO_27_FUNC_SEL_LEN  (5U)
#define GLB_REG_GPIO_27_FUNC_SEL_MSK  (((1U << GLB_REG_GPIO_27_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_27_FUNC_SEL_POS)
#define GLB_REG_GPIO_27_FUNC_SEL_UMSK (~(((1U << GLB_REG_GPIO_27_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_27_FUNC_SEL_POS))

/* 0x138 : GPIO_CFGCTL14 */
#define GLB_GPIO_CFGCTL14_OFFSET      (0x138)
#define GLB_REG_GPIO_28_IE            GLB_REG_GPIO_28_IE
#define GLB_REG_GPIO_28_IE_POS        (0U)
#define GLB_REG_GPIO_28_IE_LEN        (1U)
#define GLB_REG_GPIO_28_IE_MSK        (((1U << GLB_REG_GPIO_28_IE_LEN) - 1) << GLB_REG_GPIO_28_IE_POS)
#define GLB_REG_GPIO_28_IE_UMSK       (~(((1U << GLB_REG_GPIO_28_IE_LEN) - 1) << GLB_REG_GPIO_28_IE_POS))
#define GLB_REG_GPIO_28_SMT           GLB_REG_GPIO_28_SMT
#define GLB_REG_GPIO_28_SMT_POS       (1U)
#define GLB_REG_GPIO_28_SMT_LEN       (1U)
#define GLB_REG_GPIO_28_SMT_MSK       (((1U << GLB_REG_GPIO_28_SMT_LEN) - 1) << GLB_REG_GPIO_28_SMT_POS)
#define GLB_REG_GPIO_28_SMT_UMSK      (~(((1U << GLB_REG_GPIO_28_SMT_LEN) - 1) << GLB_REG_GPIO_28_SMT_POS))
#define GLB_REG_GPIO_28_DRV           GLB_REG_GPIO_28_DRV
#define GLB_REG_GPIO_28_DRV_POS       (2U)
#define GLB_REG_GPIO_28_DRV_LEN       (2U)
#define GLB_REG_GPIO_28_DRV_MSK       (((1U << GLB_REG_GPIO_28_DRV_LEN) - 1) << GLB_REG_GPIO_28_DRV_POS)
#define GLB_REG_GPIO_28_DRV_UMSK      (~(((1U << GLB_REG_GPIO_28_DRV_LEN) - 1) << GLB_REG_GPIO_28_DRV_POS))
#define GLB_REG_GPIO_28_PU            GLB_REG_GPIO_28_PU
#define GLB_REG_GPIO_28_PU_POS        (4U)
#define GLB_REG_GPIO_28_PU_LEN        (1U)
#define GLB_REG_GPIO_28_PU_MSK        (((1U << GLB_REG_GPIO_28_PU_LEN) - 1) << GLB_REG_GPIO_28_PU_POS)
#define GLB_REG_GPIO_28_PU_UMSK       (~(((1U << GLB_REG_GPIO_28_PU_LEN) - 1) << GLB_REG_GPIO_28_PU_POS))
#define GLB_REG_GPIO_28_PD            GLB_REG_GPIO_28_PD
#define GLB_REG_GPIO_28_PD_POS        (5U)
#define GLB_REG_GPIO_28_PD_LEN        (1U)
#define GLB_REG_GPIO_28_PD_MSK        (((1U << GLB_REG_GPIO_28_PD_LEN) - 1) << GLB_REG_GPIO_28_PD_POS)
#define GLB_REG_GPIO_28_PD_UMSK       (~(((1U << GLB_REG_GPIO_28_PD_LEN) - 1) << GLB_REG_GPIO_28_PD_POS))
#define GLB_REG_GPIO_28_FUNC_SEL      GLB_REG_GPIO_28_FUNC_SEL
#define GLB_REG_GPIO_28_FUNC_SEL_POS  (8U)
#define GLB_REG_GPIO_28_FUNC_SEL_LEN  (5U)
#define GLB_REG_GPIO_28_FUNC_SEL_MSK  (((1U << GLB_REG_GPIO_28_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_28_FUNC_SEL_POS)
#define GLB_REG_GPIO_28_FUNC_SEL_UMSK (~(((1U << GLB_REG_GPIO_28_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_28_FUNC_SEL_POS))
#define GLB_REG_GPIO_29_IE            GLB_REG_GPIO_29_IE
#define GLB_REG_GPIO_29_IE_POS        (16U)
#define GLB_REG_GPIO_29_IE_LEN        (1U)
#define GLB_REG_GPIO_29_IE_MSK        (((1U << GLB_REG_GPIO_29_IE_LEN) - 1) << GLB_REG_GPIO_29_IE_POS)
#define GLB_REG_GPIO_29_IE_UMSK       (~(((1U << GLB_REG_GPIO_29_IE_LEN) - 1) << GLB_REG_GPIO_29_IE_POS))
#define GLB_REG_GPIO_29_SMT           GLB_REG_GPIO_29_SMT
#define GLB_REG_GPIO_29_SMT_POS       (17U)
#define GLB_REG_GPIO_29_SMT_LEN       (1U)
#define GLB_REG_GPIO_29_SMT_MSK       (((1U << GLB_REG_GPIO_29_SMT_LEN) - 1) << GLB_REG_GPIO_29_SMT_POS)
#define GLB_REG_GPIO_29_SMT_UMSK      (~(((1U << GLB_REG_GPIO_29_SMT_LEN) - 1) << GLB_REG_GPIO_29_SMT_POS))
#define GLB_REG_GPIO_29_DRV           GLB_REG_GPIO_29_DRV
#define GLB_REG_GPIO_29_DRV_POS       (18U)
#define GLB_REG_GPIO_29_DRV_LEN       (2U)
#define GLB_REG_GPIO_29_DRV_MSK       (((1U << GLB_REG_GPIO_29_DRV_LEN) - 1) << GLB_REG_GPIO_29_DRV_POS)
#define GLB_REG_GPIO_29_DRV_UMSK      (~(((1U << GLB_REG_GPIO_29_DRV_LEN) - 1) << GLB_REG_GPIO_29_DRV_POS))
#define GLB_REG_GPIO_29_PU            GLB_REG_GPIO_29_PU
#define GLB_REG_GPIO_29_PU_POS        (20U)
#define GLB_REG_GPIO_29_PU_LEN        (1U)
#define GLB_REG_GPIO_29_PU_MSK        (((1U << GLB_REG_GPIO_29_PU_LEN) - 1) << GLB_REG_GPIO_29_PU_POS)
#define GLB_REG_GPIO_29_PU_UMSK       (~(((1U << GLB_REG_GPIO_29_PU_LEN) - 1) << GLB_REG_GPIO_29_PU_POS))
#define GLB_REG_GPIO_29_PD            GLB_REG_GPIO_29_PD
#define GLB_REG_GPIO_29_PD_POS        (21U)
#define GLB_REG_GPIO_29_PD_LEN        (1U)
#define GLB_REG_GPIO_29_PD_MSK        (((1U << GLB_REG_GPIO_29_PD_LEN) - 1) << GLB_REG_GPIO_29_PD_POS)
#define GLB_REG_GPIO_29_PD_UMSK       (~(((1U << GLB_REG_GPIO_29_PD_LEN) - 1) << GLB_REG_GPIO_29_PD_POS))
#define GLB_REG_GPIO_29_FUNC_SEL      GLB_REG_GPIO_29_FUNC_SEL
#define GLB_REG_GPIO_29_FUNC_SEL_POS  (24U)
#define GLB_REG_GPIO_29_FUNC_SEL_LEN  (5U)
#define GLB_REG_GPIO_29_FUNC_SEL_MSK  (((1U << GLB_REG_GPIO_29_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_29_FUNC_SEL_POS)
#define GLB_REG_GPIO_29_FUNC_SEL_UMSK (~(((1U << GLB_REG_GPIO_29_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_29_FUNC_SEL_POS))

/* 0x13C : GPIO_CFGCTL15 */
#define GLB_GPIO_CFGCTL15_OFFSET      (0x13C)
#define GLB_REG_GPIO_30_IE            GLB_REG_GPIO_30_IE
#define GLB_REG_GPIO_30_IE_POS        (0U)
#define GLB_REG_GPIO_30_IE_LEN        (1U)
#define GLB_REG_GPIO_30_IE_MSK        (((1U << GLB_REG_GPIO_30_IE_LEN) - 1) << GLB_REG_GPIO_30_IE_POS)
#define GLB_REG_GPIO_30_IE_UMSK       (~(((1U << GLB_REG_GPIO_30_IE_LEN) - 1) << GLB_REG_GPIO_30_IE_POS))
#define GLB_REG_GPIO_30_SMT           GLB_REG_GPIO_30_SMT
#define GLB_REG_GPIO_30_SMT_POS       (1U)
#define GLB_REG_GPIO_30_SMT_LEN       (1U)
#define GLB_REG_GPIO_30_SMT_MSK       (((1U << GLB_REG_GPIO_30_SMT_LEN) - 1) << GLB_REG_GPIO_30_SMT_POS)
#define GLB_REG_GPIO_30_SMT_UMSK      (~(((1U << GLB_REG_GPIO_30_SMT_LEN) - 1) << GLB_REG_GPIO_30_SMT_POS))
#define GLB_REG_GPIO_30_DRV           GLB_REG_GPIO_30_DRV
#define GLB_REG_GPIO_30_DRV_POS       (2U)
#define GLB_REG_GPIO_30_DRV_LEN       (2U)
#define GLB_REG_GPIO_30_DRV_MSK       (((1U << GLB_REG_GPIO_30_DRV_LEN) - 1) << GLB_REG_GPIO_30_DRV_POS)
#define GLB_REG_GPIO_30_DRV_UMSK      (~(((1U << GLB_REG_GPIO_30_DRV_LEN) - 1) << GLB_REG_GPIO_30_DRV_POS))
#define GLB_REG_GPIO_30_PU            GLB_REG_GPIO_30_PU
#define GLB_REG_GPIO_30_PU_POS        (4U)
#define GLB_REG_GPIO_30_PU_LEN        (1U)
#define GLB_REG_GPIO_30_PU_MSK        (((1U << GLB_REG_GPIO_30_PU_LEN) - 1) << GLB_REG_GPIO_30_PU_POS)
#define GLB_REG_GPIO_30_PU_UMSK       (~(((1U << GLB_REG_GPIO_30_PU_LEN) - 1) << GLB_REG_GPIO_30_PU_POS))
#define GLB_REG_GPIO_30_PD            GLB_REG_GPIO_30_PD
#define GLB_REG_GPIO_30_PD_POS        (5U)
#define GLB_REG_GPIO_30_PD_LEN        (1U)
#define GLB_REG_GPIO_30_PD_MSK        (((1U << GLB_REG_GPIO_30_PD_LEN) - 1) << GLB_REG_GPIO_30_PD_POS)
#define GLB_REG_GPIO_30_PD_UMSK       (~(((1U << GLB_REG_GPIO_30_PD_LEN) - 1) << GLB_REG_GPIO_30_PD_POS))
#define GLB_REG_GPIO_30_FUNC_SEL      GLB_REG_GPIO_30_FUNC_SEL
#define GLB_REG_GPIO_30_FUNC_SEL_POS  (8U)
#define GLB_REG_GPIO_30_FUNC_SEL_LEN  (5U)
#define GLB_REG_GPIO_30_FUNC_SEL_MSK  (((1U << GLB_REG_GPIO_30_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_30_FUNC_SEL_POS)
#define GLB_REG_GPIO_30_FUNC_SEL_UMSK (~(((1U << GLB_REG_GPIO_30_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_30_FUNC_SEL_POS))
#define GLB_REG_GPIO_31_IE            GLB_REG_GPIO_31_IE
#define GLB_REG_GPIO_31_IE_POS        (16U)
#define GLB_REG_GPIO_31_IE_LEN        (1U)
#define GLB_REG_GPIO_31_IE_MSK        (((1U << GLB_REG_GPIO_31_IE_LEN) - 1) << GLB_REG_GPIO_31_IE_POS)
#define GLB_REG_GPIO_31_IE_UMSK       (~(((1U << GLB_REG_GPIO_31_IE_LEN) - 1) << GLB_REG_GPIO_31_IE_POS))
#define GLB_REG_GPIO_31_SMT           GLB_REG_GPIO_31_SMT
#define GLB_REG_GPIO_31_SMT_POS       (17U)
#define GLB_REG_GPIO_31_SMT_LEN       (1U)
#define GLB_REG_GPIO_31_SMT_MSK       (((1U << GLB_REG_GPIO_31_SMT_LEN) - 1) << GLB_REG_GPIO_31_SMT_POS)
#define GLB_REG_GPIO_31_SMT_UMSK      (~(((1U << GLB_REG_GPIO_31_SMT_LEN) - 1) << GLB_REG_GPIO_31_SMT_POS))
#define GLB_REG_GPIO_31_DRV           GLB_REG_GPIO_31_DRV
#define GLB_REG_GPIO_31_DRV_POS       (18U)
#define GLB_REG_GPIO_31_DRV_LEN       (2U)
#define GLB_REG_GPIO_31_DRV_MSK       (((1U << GLB_REG_GPIO_31_DRV_LEN) - 1) << GLB_REG_GPIO_31_DRV_POS)
#define GLB_REG_GPIO_31_DRV_UMSK      (~(((1U << GLB_REG_GPIO_31_DRV_LEN) - 1) << GLB_REG_GPIO_31_DRV_POS))
#define GLB_REG_GPIO_31_PU            GLB_REG_GPIO_31_PU
#define GLB_REG_GPIO_31_PU_POS        (20U)
#define GLB_REG_GPIO_31_PU_LEN        (1U)
#define GLB_REG_GPIO_31_PU_MSK        (((1U << GLB_REG_GPIO_31_PU_LEN) - 1) << GLB_REG_GPIO_31_PU_POS)
#define GLB_REG_GPIO_31_PU_UMSK       (~(((1U << GLB_REG_GPIO_31_PU_LEN) - 1) << GLB_REG_GPIO_31_PU_POS))
#define GLB_REG_GPIO_31_PD            GLB_REG_GPIO_31_PD
#define GLB_REG_GPIO_31_PD_POS        (21U)
#define GLB_REG_GPIO_31_PD_LEN        (1U)
#define GLB_REG_GPIO_31_PD_MSK        (((1U << GLB_REG_GPIO_31_PD_LEN) - 1) << GLB_REG_GPIO_31_PD_POS)
#define GLB_REG_GPIO_31_PD_UMSK       (~(((1U << GLB_REG_GPIO_31_PD_LEN) - 1) << GLB_REG_GPIO_31_PD_POS))
#define GLB_REG_GPIO_31_FUNC_SEL      GLB_REG_GPIO_31_FUNC_SEL
#define GLB_REG_GPIO_31_FUNC_SEL_POS  (24U)
#define GLB_REG_GPIO_31_FUNC_SEL_LEN  (5U)
#define GLB_REG_GPIO_31_FUNC_SEL_MSK  (((1U << GLB_REG_GPIO_31_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_31_FUNC_SEL_POS)
#define GLB_REG_GPIO_31_FUNC_SEL_UMSK (~(((1U << GLB_REG_GPIO_31_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_31_FUNC_SEL_POS))

/* 0x140 : GPIO_CFGCTL16 */
#define GLB_GPIO_CFGCTL16_OFFSET (0x140)
#define GLB_REG_GPIO_32_IE       GLB_REG_GPIO_32_IE
#define GLB_REG_GPIO_32_IE_POS   (0U)
#define GLB_REG_GPIO_32_IE_LEN   (1U)
#define GLB_REG_GPIO_32_IE_MSK   (((1U << GLB_REG_GPIO_32_IE_LEN) - 1) << GLB_REG_GPIO_32_IE_POS)
#define GLB_REG_GPIO_32_IE_UMSK  (~(((1U << GLB_REG_GPIO_32_IE_LEN) - 1) << GLB_REG_GPIO_32_IE_POS))
#define GLB_REG_GPIO_32_SMT      GLB_REG_GPIO_32_SMT
#define GLB_REG_GPIO_32_SMT_POS  (1U)
#define GLB_REG_GPIO_32_SMT_LEN  (1U)
#define GLB_REG_GPIO_32_SMT_MSK  (((1U << GLB_REG_GPIO_32_SMT_LEN) - 1) << GLB_REG_GPIO_32_SMT_POS)
#define GLB_REG_GPIO_32_SMT_UMSK (~(((1U << GLB_REG_GPIO_32_SMT_LEN) - 1) << GLB_REG_GPIO_32_SMT_POS))
#define GLB_REG_GPIO_32_DRV      GLB_REG_GPIO_32_DRV
#define GLB_REG_GPIO_32_DRV_POS  (2U)
#define GLB_REG_GPIO_32_DRV_LEN  (2U)
#define GLB_REG_GPIO_32_DRV_MSK  (((1U << GLB_REG_GPIO_32_DRV_LEN) - 1) << GLB_REG_GPIO_32_DRV_POS)
#define GLB_REG_GPIO_32_DRV_UMSK (~(((1U << GLB_REG_GPIO_32_DRV_LEN) - 1) << GLB_REG_GPIO_32_DRV_POS))
#define GLB_REG_GPIO_32_PU       GLB_REG_GPIO_32_PU
#define GLB_REG_GPIO_32_PU_POS   (4U)
#define GLB_REG_GPIO_32_PU_LEN   (1U)
#define GLB_REG_GPIO_32_PU_MSK   (((1U << GLB_REG_GPIO_32_PU_LEN) - 1) << GLB_REG_GPIO_32_PU_POS)
#define GLB_REG_GPIO_32_PU_UMSK  (~(((1U << GLB_REG_GPIO_32_PU_LEN) - 1) << GLB_REG_GPIO_32_PU_POS))
#define GLB_REG_GPIO_32_PD       GLB_REG_GPIO_32_PD
#define GLB_REG_GPIO_32_PD_POS   (5U)
#define GLB_REG_GPIO_32_PD_LEN   (1U)
#define GLB_REG_GPIO_32_PD_MSK   (((1U << GLB_REG_GPIO_32_PD_LEN) - 1) << GLB_REG_GPIO_32_PD_POS)
#define GLB_REG_GPIO_32_PD_UMSK  (~(((1U << GLB_REG_GPIO_32_PD_LEN) - 1) << GLB_REG_GPIO_32_PD_POS))
#define GLB_REG_GPIO_33_IE       GLB_REG_GPIO_33_IE
#define GLB_REG_GPIO_33_IE_POS   (16U)
#define GLB_REG_GPIO_33_IE_LEN   (1U)
#define GLB_REG_GPIO_33_IE_MSK   (((1U << GLB_REG_GPIO_33_IE_LEN) - 1) << GLB_REG_GPIO_33_IE_POS)
#define GLB_REG_GPIO_33_IE_UMSK  (~(((1U << GLB_REG_GPIO_33_IE_LEN) - 1) << GLB_REG_GPIO_33_IE_POS))
#define GLB_REG_GPIO_33_SMT      GLB_REG_GPIO_33_SMT
#define GLB_REG_GPIO_33_SMT_POS  (17U)
#define GLB_REG_GPIO_33_SMT_LEN  (1U)
#define GLB_REG_GPIO_33_SMT_MSK  (((1U << GLB_REG_GPIO_33_SMT_LEN) - 1) << GLB_REG_GPIO_33_SMT_POS)
#define GLB_REG_GPIO_33_SMT_UMSK (~(((1U << GLB_REG_GPIO_33_SMT_LEN) - 1) << GLB_REG_GPIO_33_SMT_POS))
#define GLB_REG_GPIO_33_DRV      GLB_REG_GPIO_33_DRV
#define GLB_REG_GPIO_33_DRV_POS  (18U)
#define GLB_REG_GPIO_33_DRV_LEN  (2U)
#define GLB_REG_GPIO_33_DRV_MSK  (((1U << GLB_REG_GPIO_33_DRV_LEN) - 1) << GLB_REG_GPIO_33_DRV_POS)
#define GLB_REG_GPIO_33_DRV_UMSK (~(((1U << GLB_REG_GPIO_33_DRV_LEN) - 1) << GLB_REG_GPIO_33_DRV_POS))
#define GLB_REG_GPIO_33_PU       GLB_REG_GPIO_33_PU
#define GLB_REG_GPIO_33_PU_POS   (20U)
#define GLB_REG_GPIO_33_PU_LEN   (1U)
#define GLB_REG_GPIO_33_PU_MSK   (((1U << GLB_REG_GPIO_33_PU_LEN) - 1) << GLB_REG_GPIO_33_PU_POS)
#define GLB_REG_GPIO_33_PU_UMSK  (~(((1U << GLB_REG_GPIO_33_PU_LEN) - 1) << GLB_REG_GPIO_33_PU_POS))
#define GLB_REG_GPIO_33_PD       GLB_REG_GPIO_33_PD
#define GLB_REG_GPIO_33_PD_POS   (21U)
#define GLB_REG_GPIO_33_PD_LEN   (1U)
#define GLB_REG_GPIO_33_PD_MSK   (((1U << GLB_REG_GPIO_33_PD_LEN) - 1) << GLB_REG_GPIO_33_PD_POS)
#define GLB_REG_GPIO_33_PD_UMSK  (~(((1U << GLB_REG_GPIO_33_PD_LEN) - 1) << GLB_REG_GPIO_33_PD_POS))

