RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl702/std/include/hardware/glb_reg.h
/* 0x1B0 : GPIO_INT_CLR1 */
#define GLB_GPIO_INT_CLR1_OFFSET   (0x1B0)
#define GLB_REG_GPIO_INT_CLR1      GLB_REG_GPIO_INT_CLR1
#define GLB_REG_GPIO_INT_CLR1_POS  (0U)
#define GLB_REG_GPIO_INT_CLR1_LEN  (32U)
#define GLB_REG_GPIO_INT_CLR1_MSK  (((1U << GLB_REG_GPIO_INT_CLR1_LEN) - 1) << GLB_REG_GPIO_INT_CLR1_POS)
#define GLB_REG_GPIO_INT_CLR1_UMSK (~(((1U << GLB_REG_GPIO_INT_CLR1_LEN) - 1) << GLB_REG_GPIO_INT_CLR1_POS))

/* 0x1C0 : GPIO_INT_MODE_SET1 */
#define GLB_GPIO_INT_MODE_SET1_OFFSET   (0x1C0)
#define GLB_REG_GPIO_INT_MODE_SET1      GLB_REG_GPIO_INT_MODE_SET1
#define GLB_REG_GPIO_INT_MODE_SET1_POS  (0U)
#define GLB_REG_GPIO_INT_MODE_SET1_LEN  (30U)
#define GLB_REG_GPIO_INT_MODE_SET1_MSK  (((1U << GLB_REG_GPIO_INT_MODE_SET1_LEN) - 1) << GLB_REG_GPIO_INT_MODE_SET1_POS)
#define GLB_REG_GPIO_INT_MODE_SET1_UMSK (~(((1U << GLB_REG_GPIO_INT_MODE_SET1_LEN) - 1) << GLB_REG_GPIO_INT_MODE_SET1_POS))

/* 0x1C4 : GPIO_INT_MODE_SET2 */
#define GLB_GPIO_INT_MODE_SET2_OFFSET   (0x1C4)
#define GLB_REG_GPIO_INT_MODE_SET2      GLB_REG_GPIO_INT_MODE_SET2
#define GLB_REG_GPIO_INT_MODE_SET2_POS  (0U)
#define GLB_REG_GPIO_INT_MODE_SET2_LEN  (30U)
#define GLB_REG_GPIO_INT_MODE_SET2_MSK  (((1U << GLB_REG_GPIO_INT_MODE_SET2_LEN) - 1) << GLB_REG_GPIO_INT_MODE_SET2_POS)
#define GLB_REG_GPIO_INT_MODE_SET2_UMSK (~(((1U << GLB_REG_GPIO_INT_MODE_SET2_LEN) - 1) << GLB_REG_GPIO_INT_MODE_SET2_POS))

/* 0x1C8 : GPIO_INT_MODE_SET3 */
#define GLB_GPIO_INT_MODE_SET3_OFFSET   (0x1C8)
#define GLB_REG_GPIO_INT_MODE_SET3      GLB_REG_GPIO_INT_MODE_SET3
#define GLB_REG_GPIO_INT_MODE_SET3_POS  (0U)
#define GLB_REG_GPIO_INT_MODE_SET3_LEN  (30U)
#define GLB_REG_GPIO_INT_MODE_SET3_MSK  (((1U << GLB_REG_GPIO_INT_MODE_SET3_LEN) - 1) << GLB_REG_GPIO_INT_MODE_SET3_POS)
#define GLB_REG_GPIO_INT_MODE_SET3_UMSK (~(((1U << GLB_REG_GPIO_INT_MODE_SET3_LEN) - 1) << GLB_REG_GPIO_INT_MODE_SET3_POS))

/* 0x1CC : GPIO_INT_MODE_SET4 */
#define GLB_GPIO_INT_MODE_SET4_OFFSET   (0x1CC)
#define GLB_REG_GPIO_INT_MODE_SET4      GLB_REG_GPIO_INT_MODE_SET4
#define GLB_REG_GPIO_INT_MODE_SET4_POS  (0U)
#define GLB_REG_GPIO_INT_MODE_SET4_LEN  (6U)
#define GLB_REG_GPIO_INT_MODE_SET4_MSK  (((1U << GLB_REG_GPIO_INT_MODE_SET4_LEN) - 1) << GLB_REG_GPIO_INT_MODE_SET4_POS)
#define GLB_REG_GPIO_INT_MODE_SET4_UMSK (~(((1U << GLB_REG_GPIO_INT_MODE_SET4_LEN) - 1) << GLB_REG_GPIO_INT_MODE_SET4_POS))

/* 0x1D0 : GPIO_INT2_MASK1 */
#define GLB_GPIO_INT2_MASK1_OFFSET   (0x1D0)
#define GLB_REG_GPIO_INT2_MASK1      GLB_REG_GPIO_INT2_MASK1
#define GLB_REG_GPIO_INT2_MASK1_POS  (0U)
#define GLB_REG_GPIO_INT2_MASK1_LEN  (32U)
#define GLB_REG_GPIO_INT2_MASK1_MSK  (((1U << GLB_REG_GPIO_INT2_MASK1_LEN) - 1) << GLB_REG_GPIO_INT2_MASK1_POS)
#define GLB_REG_GPIO_INT2_MASK1_UMSK (~(((1U << GLB_REG_GPIO_INT2_MASK1_LEN) - 1) << GLB_REG_GPIO_INT2_MASK1_POS))

/* 0x1D4 : GPIO_INT2_STAT1 */
#define GLB_GPIO_INT2_STAT1_OFFSET (0x1D4)
#define GLB_GPIO_INT2_STAT1        GLB_GPIO_INT2_STAT1
#define GLB_GPIO_INT2_STAT1_POS    (0U)
#define GLB_GPIO_INT2_STAT1_LEN    (32U)
#define GLB_GPIO_INT2_STAT1_MSK    (((1U << GLB_GPIO_INT2_STAT1_LEN) - 1) << GLB_GPIO_INT2_STAT1_POS)
#define GLB_GPIO_INT2_STAT1_UMSK   (~(((1U << GLB_GPIO_INT2_STAT1_LEN) - 1) << GLB_GPIO_INT2_STAT1_POS))

/* 0x1D8 : GPIO_INT2_CLR1 */
#define GLB_GPIO_INT2_CLR1_OFFSET   (0x1D8)
#define GLB_REG_GPIO_INT2_CLR1      GLB_REG_GPIO_INT2_CLR1
#define GLB_REG_GPIO_INT2_CLR1_POS  (0U)
#define GLB_REG_GPIO_INT2_CLR1_LEN  (32U)
#define GLB_REG_GPIO_INT2_CLR1_MSK  (((1U << GLB_REG_GPIO_INT2_CLR1_LEN) - 1) << GLB_REG_GPIO_INT2_CLR1_POS)
#define GLB_REG_GPIO_INT2_CLR1_UMSK (~(((1U << GLB_REG_GPIO_INT2_CLR1_LEN) - 1) << GLB_REG_GPIO_INT2_CLR1_POS))

/* 0x1DC : GPIO_INT2_MODE_SET1 */
#define GLB_GPIO_INT2_MODE_SET1_OFFSET   (0x1DC)
#define GLB_REG_GPIO_INT2_MODE_SET1      GLB_REG_GPIO_INT2_MODE_SET1
#define GLB_REG_GPIO_INT2_MODE_SET1_POS  (0U)
#define GLB_REG_GPIO_INT2_MODE_SET1_LEN  (30U)
#define GLB_REG_GPIO_INT2_MODE_SET1_MSK  (((1U << GLB_REG_GPIO_INT2_MODE_SET1_LEN) - 1) << GLB_REG_GPIO_INT2_MODE_SET1_POS)
#define GLB_REG_GPIO_INT2_MODE_SET1_UMSK (~(((1U << GLB_REG_GPIO_INT2_MODE_SET1_LEN) - 1) << GLB_REG_GPIO_INT2_MODE_SET1_POS))

/* 0x1E0 : GPIO_INT2_MODE_SET2 */
#define GLB_GPIO_INT2_MODE_SET2_OFFSET   (0x1E0)
#define GLB_REG_GPIO_INT2_MODE_SET2      GLB_REG_GPIO_INT2_MODE_SET2
#define GLB_REG_GPIO_INT2_MODE_SET2_POS  (0U)
#define GLB_REG_GPIO_INT2_MODE_SET2_LEN  (30U)
#define GLB_REG_GPIO_INT2_MODE_SET2_MSK  (((1U << GLB_REG_GPIO_INT2_MODE_SET2_LEN) - 1) << GLB_REG_GPIO_INT2_MODE_SET2_POS)
#define GLB_REG_GPIO_INT2_MODE_SET2_UMSK (~(((1U << GLB_REG_GPIO_INT2_MODE_SET2_LEN) - 1) << GLB_REG_GPIO_INT2_MODE_SET2_POS))

/* 0x1E4 : GPIO_INT2_MODE_SET3 */
#define GLB_GPIO_INT2_MODE_SET3_OFFSET   (0x1E4)
#define GLB_REG_GPIO_INT2_MODE_SET3      GLB_REG_GPIO_INT2_MODE_SET3
#define GLB_REG_GPIO_INT2_MODE_SET3_POS  (0U)
#define GLB_REG_GPIO_INT2_MODE_SET3_LEN  (30U)
#define GLB_REG_GPIO_INT2_MODE_SET3_MSK  (((1U << GLB_REG_GPIO_INT2_MODE_SET3_LEN) - 1) << GLB_REG_GPIO_INT2_MODE_SET3_POS)
#define GLB_REG_GPIO_INT2_MODE_SET3_UMSK (~(((1U << GLB_REG_GPIO_INT2_MODE_SET3_LEN) - 1) << GLB_REG_GPIO_INT2_MODE_SET3_POS))

/* 0x1E8 : GPIO_INT2_MODE_SET4 */
#define GLB_GPIO_INT2_MODE_SET4_OFFSET   (0x1E8)
#define GLB_REG_GPIO_INT2_MODE_SET4      GLB_REG_GPIO_INT2_MODE_SET4
#define GLB_REG_GPIO_INT2_MODE_SET4_POS  (0U)
#define GLB_REG_GPIO_INT2_MODE_SET4_LEN  (6U)
#define GLB_REG_GPIO_INT2_MODE_SET4_MSK  (((1U << GLB_REG_GPIO_INT2_MODE_SET4_LEN) - 1) << GLB_REG_GPIO_INT2_MODE_SET4_POS)
#define GLB_REG_GPIO_INT2_MODE_SET4_UMSK (~(((1U << GLB_REG_GPIO_INT2_MODE_SET4_LEN) - 1) << GLB_REG_GPIO_INT2_MODE_SET4_POS))

/* 0x200 : dll */
#define GLB_DLL_OFFSET               (0x200)
#define GLB_DTEST_EN_DLL_REFCLK      GLB_DTEST_EN_DLL_REFCLK
#define GLB_DTEST_EN_DLL_REFCLK_POS  (0U)
#define GLB_DTEST_EN_DLL_REFCLK_LEN  (1U)
#define GLB_DTEST_EN_DLL_REFCLK_MSK  (((1U << GLB_DTEST_EN_DLL_REFCLK_LEN) - 1) << GLB_DTEST_EN_DLL_REFCLK_POS)
#define GLB_DTEST_EN_DLL_REFCLK_UMSK (~(((1U << GLB_DTEST_EN_DLL_REFCLK_LEN) - 1) << GLB_DTEST_EN_DLL_REFCLK_POS))
#define GLB_DTEST_EN_DLL_OUTCLK      GLB_DTEST_EN_DLL_OUTCLK
#define GLB_DTEST_EN_DLL_OUTCLK_POS  (1U)
#define GLB_DTEST_EN_DLL_OUTCLK_LEN  (1U)
#define GLB_DTEST_EN_DLL_OUTCLK_MSK  (((1U << GLB_DTEST_EN_DLL_OUTCLK_LEN) - 1) << GLB_DTEST_EN_DLL_OUTCLK_POS)
#define GLB_DTEST_EN_DLL_OUTCLK_UMSK (~(((1U << GLB_DTEST_EN_DLL_OUTCLK_LEN) - 1) << GLB_DTEST_EN_DLL_OUTCLK_POS))
#define GLB_TEN_DLL                  GLB_TEN_DLL
#define GLB_TEN_DLL_POS              (2U)
#define GLB_TEN_DLL_LEN              (1U)
#define GLB_TEN_DLL_MSK              (((1U << GLB_TEN_DLL_LEN) - 1) << GLB_TEN_DLL_POS)
#define GLB_TEN_DLL_UMSK             (~(((1U << GLB_TEN_DLL_LEN) - 1) << GLB_TEN_DLL_POS))
#define GLB_DLL_CLK_MMDIV_EN         GLB_DLL_CLK_MMDIV_EN
#define GLB_DLL_CLK_MMDIV_EN_POS     (3U)
#define GLB_DLL_CLK_MMDIV_EN_LEN     (1U)
#define GLB_DLL_CLK_MMDIV_EN_MSK     (((1U << GLB_DLL_CLK_MMDIV_EN_LEN) - 1) << GLB_DLL_CLK_MMDIV_EN_POS)
#define GLB_DLL_CLK_MMDIV_EN_UMSK    (~(((1U << GLB_DLL_CLK_MMDIV_EN_LEN) - 1) << GLB_DLL_CLK_MMDIV_EN_POS))
#define GLB_DLL_CLK_288M_EN          GLB_DLL_CLK_288M_EN
#define GLB_DLL_CLK_288M_EN_POS      (4U)
#define GLB_DLL_CLK_288M_EN_LEN      (1U)
#define GLB_DLL_CLK_288M_EN_MSK      (((1U << GLB_DLL_CLK_288M_EN_LEN) - 1) << GLB_DLL_CLK_288M_EN_POS)
#define GLB_DLL_CLK_288M_EN_UMSK     (~(((1U << GLB_DLL_CLK_288M_EN_LEN) - 1) << GLB_DLL_CLK_288M_EN_POS))
#define GLB_DLL_CLK_144M_EN          GLB_DLL_CLK_144M_EN
#define GLB_DLL_CLK_144M_EN_POS      (5U)
#define GLB_DLL_CLK_144M_EN_LEN      (1U)
#define GLB_DLL_CLK_144M_EN_MSK      (((1U << GLB_DLL_CLK_144M_EN_LEN) - 1) << GLB_DLL_CLK_144M_EN_POS)
#define GLB_DLL_CLK_144M_EN_UMSK     (~(((1U << GLB_DLL_CLK_144M_EN_LEN) - 1) << GLB_DLL_CLK_144M_EN_POS))
#define GLB_DLL_CLK_96M_EN           GLB_DLL_CLK_96M_EN
#define GLB_DLL_CLK_96M_EN_POS       (6U)
#define GLB_DLL_CLK_96M_EN_LEN       (1U)
#define GLB_DLL_CLK_96M_EN_MSK       (((1U << GLB_DLL_CLK_96M_EN_LEN) - 1) << GLB_DLL_CLK_96M_EN_POS)
#define GLB_DLL_CLK_96M_EN_UMSK      (~(((1U << GLB_DLL_CLK_96M_EN_LEN) - 1) << GLB_DLL_CLK_96M_EN_POS))
#define GLB_DLL_CLK_57P6M_EN         GLB_DLL_CLK_57P6M_EN
#define GLB_DLL_CLK_57P6M_EN_POS     (7U)
#define GLB_DLL_CLK_57P6M_EN_LEN     (1U)
#define GLB_DLL_CLK_57P6M_EN_MSK     (((1U << GLB_DLL_CLK_57P6M_EN_LEN) - 1) << GLB_DLL_CLK_57P6M_EN_POS)
#define GLB_DLL_CLK_57P6M_EN_UMSK    (~(((1U << GLB_DLL_CLK_57P6M_EN_LEN) - 1) << GLB_DLL_CLK_57P6M_EN_POS))
#define GLB_DLL_VCTRL_SEL            GLB_DLL_VCTRL_SEL
#define GLB_DLL_VCTRL_SEL_POS        (8U)
#define GLB_DLL_VCTRL_SEL_LEN        (3U)
#define GLB_DLL_VCTRL_SEL_MSK        (((1U << GLB_DLL_VCTRL_SEL_LEN) - 1) << GLB_DLL_VCTRL_SEL_POS)
#define GLB_DLL_VCTRL_SEL_UMSK       (~(((1U << GLB_DLL_VCTRL_SEL_LEN) - 1) << GLB_DLL_VCTRL_SEL_POS))
#define GLB_DLL_PRECHG_SEL           GLB_DLL_PRECHG_SEL
#define GLB_DLL_PRECHG_SEL_POS       (12U)
#define GLB_DLL_PRECHG_SEL_LEN       (1U)
#define GLB_DLL_PRECHG_SEL_MSK       (((1U << GLB_DLL_PRECHG_SEL_LEN) - 1) << GLB_DLL_PRECHG_SEL_POS)
#define GLB_DLL_PRECHG_SEL_UMSK      (~(((1U << GLB_DLL_PRECHG_SEL_LEN) - 1) << GLB_DLL_PRECHG_SEL_POS))
#define GLB_DLL_PRECHG_REG           GLB_DLL_PRECHG_REG
#define GLB_DLL_PRECHG_REG_POS       (13U)
#define GLB_DLL_PRECHG_REG_LEN       (1U)
#define GLB_DLL_PRECHG_REG_MSK       (((1U << GLB_DLL_PRECHG_REG_LEN) - 1) << GLB_DLL_PRECHG_REG_POS)
#define GLB_DLL_PRECHG_REG_UMSK      (~(((1U << GLB_DLL_PRECHG_REG_LEN) - 1) << GLB_DLL_PRECHG_REG_POS))
#define GLB_DLL_PRECHG_EN            GLB_DLL_PRECHG_EN
#define GLB_DLL_PRECHG_EN_POS        (14U)
#define GLB_DLL_PRECHG_EN_LEN        (1U)
#define GLB_DLL_PRECHG_EN_MSK        (((1U << GLB_DLL_PRECHG_EN_LEN) - 1) << GLB_DLL_PRECHG_EN_POS)
#define GLB_DLL_PRECHG_EN_UMSK       (~(((1U << GLB_DLL_PRECHG_EN_LEN) - 1) << GLB_DLL_PRECHG_EN_POS))
#define GLB_DLL_VCTRL_FORCE_EN       GLB_DLL_VCTRL_FORCE_EN
#define GLB_DLL_VCTRL_FORCE_EN_POS   (15U)
#define GLB_DLL_VCTRL_FORCE_EN_LEN   (1U)
#define GLB_DLL_VCTRL_FORCE_EN_MSK   (((1U << GLB_DLL_VCTRL_FORCE_EN_LEN) - 1) << GLB_DLL_VCTRL_FORCE_EN_POS)
#define GLB_DLL_VCTRL_FORCE_EN_UMSK  (~(((1U << GLB_DLL_VCTRL_FORCE_EN_LEN) - 1) << GLB_DLL_VCTRL_FORCE_EN_POS))
#define GLB_DLL_POST_DIV             GLB_DLL_POST_DIV
#define GLB_DLL_POST_DIV_POS         (16U)
#define GLB_DLL_POST_DIV_LEN         (4U)
#define GLB_DLL_POST_DIV_MSK         (((1U << GLB_DLL_POST_DIV_LEN) - 1) << GLB_DLL_POST_DIV_POS)
#define GLB_DLL_POST_DIV_UMSK        (~(((1U << GLB_DLL_POST_DIV_LEN) - 1) << GLB_DLL_POST_DIV_POS))
#define GLB_DLL_DELAY_SEL            GLB_DLL_DELAY_SEL
#define GLB_DLL_DELAY_SEL_POS        (20U)
#define GLB_DLL_DELAY_SEL_LEN        (2U)
#define GLB_DLL_DELAY_SEL_MSK        (((1U << GLB_DLL_DELAY_SEL_LEN) - 1) << GLB_DLL_DELAY_SEL_POS)
#define GLB_DLL_DELAY_SEL_UMSK       (~(((1U << GLB_DLL_DELAY_SEL_LEN) - 1) << GLB_DLL_DELAY_SEL_POS))
#define GLB_DLL_CP_OP_EN             GLB_DLL_CP_OP_EN
#define GLB_DLL_CP_OP_EN_POS         (22U)
#define GLB_DLL_CP_OP_EN_LEN         (1U)
#define GLB_DLL_CP_OP_EN_MSK         (((1U << GLB_DLL_CP_OP_EN_LEN) - 1) << GLB_DLL_CP_OP_EN_POS)
#define GLB_DLL_CP_OP_EN_UMSK        (~(((1U << GLB_DLL_CP_OP_EN_LEN) - 1) << GLB_DLL_CP_OP_EN_POS))
#define GLB_DLL_CP_HIZ               GLB_DLL_CP_HIZ
#define GLB_DLL_CP_HIZ_POS           (23U)
#define GLB_DLL_CP_HIZ_LEN           (1U)
#define GLB_DLL_CP_HIZ_MSK           (((1U << GLB_DLL_CP_HIZ_LEN) - 1) << GLB_DLL_CP_HIZ_POS)
#define GLB_DLL_CP_HIZ_UMSK          (~(((1U << GLB_DLL_CP_HIZ_LEN) - 1) << GLB_DLL_CP_HIZ_POS))
#define GLB_DLL_REFCLK_SEL           GLB_DLL_REFCLK_SEL
#define GLB_DLL_REFCLK_SEL_POS       (28U)
#define GLB_DLL_REFCLK_SEL_LEN       (1U)
#define GLB_DLL_REFCLK_SEL_MSK       (((1U << GLB_DLL_REFCLK_SEL_LEN) - 1) << GLB_DLL_REFCLK_SEL_POS)
#define GLB_DLL_REFCLK_SEL_UMSK      (~(((1U << GLB_DLL_REFCLK_SEL_LEN) - 1) << GLB_DLL_REFCLK_SEL_POS))
#define GLB_DLL_RESET                GLB_DLL_RESET
#define GLB_DLL_RESET_POS            (29U)
#define GLB_DLL_RESET_LEN            (1U)
#define GLB_DLL_RESET_MSK            (((1U << GLB_DLL_RESET_LEN) - 1) << GLB_DLL_RESET_POS)
#define GLB_DLL_RESET_UMSK           (~(((1U << GLB_DLL_RESET_LEN) - 1) << GLB_DLL_RESET_POS))
#define GLB_PU_DLL                   GLB_PU_DLL
#define GLB_PU_DLL_POS               (30U)
#define GLB_PU_DLL_LEN               (1U)
#define GLB_PU_DLL_MSK               (((1U << GLB_PU_DLL_LEN) - 1) << GLB_PU_DLL_POS)
#define GLB_PU_DLL_UMSK              (~(((1U << GLB_PU_DLL_LEN) - 1) << GLB_PU_DLL_POS))
#define GLB_PPU_DLL                  GLB_PPU_DLL
#define GLB_PPU_DLL_POS              (31U)
#define GLB_PPU_DLL_LEN              (1U)
#define GLB_PPU_DLL_MSK              (((1U << GLB_PPU_DLL_LEN) - 1) << GLB_PPU_DLL_POS)
#define GLB_PPU_DLL_UMSK             (~(((1U << GLB_PPU_DLL_LEN) - 1) << GLB_PPU_DLL_POS))

/* 0x224 : led_driver */
#define GLB_LED_DRIVER_OFFSET         (0x224)
#define GLB_LED_DIN_REG               GLB_LED_DIN_REG
#define GLB_LED_DIN_REG_POS           (0U)
#define GLB_LED_DIN_REG_LEN           (1U)
#define GLB_LED_DIN_REG_MSK           (((1U << GLB_LED_DIN_REG_LEN) - 1) << GLB_LED_DIN_REG_POS)
#define GLB_LED_DIN_REG_UMSK          (~(((1U << GLB_LED_DIN_REG_LEN) - 1) << GLB_LED_DIN_REG_POS))
#define GLB_LED_DIN_SEL               GLB_LED_DIN_SEL
#define GLB_LED_DIN_SEL_POS           (1U)
#define GLB_LED_DIN_SEL_LEN           (1U)
#define GLB_LED_DIN_SEL_MSK           (((1U << GLB_LED_DIN_SEL_LEN) - 1) << GLB_LED_DIN_SEL_POS)
#define GLB_LED_DIN_SEL_UMSK          (~(((1U << GLB_LED_DIN_SEL_LEN) - 1) << GLB_LED_DIN_SEL_POS))
#define GLB_LED_DIN_POLARITY_SEL      GLB_LED_DIN_POLARITY_SEL
#define GLB_LED_DIN_POLARITY_SEL_POS  (2U)
#define GLB_LED_DIN_POLARITY_SEL_LEN  (1U)
#define GLB_LED_DIN_POLARITY_SEL_MSK  (((1U << GLB_LED_DIN_POLARITY_SEL_LEN) - 1) << GLB_LED_DIN_POLARITY_SEL_POS)
#define GLB_LED_DIN_POLARITY_SEL_UMSK (~(((1U << GLB_LED_DIN_POLARITY_SEL_LEN) - 1) << GLB_LED_DIN_POLARITY_SEL_POS))
#define GLB_LEDDRV_IBIAS              GLB_LEDDRV_IBIAS
#define GLB_LEDDRV_IBIAS_POS          (4U)
#define GLB_LEDDRV_IBIAS_LEN          (4U)
#define GLB_LEDDRV_IBIAS_MSK          (((1U << GLB_LEDDRV_IBIAS_LEN) - 1) << GLB_LEDDRV_IBIAS_POS)
#define GLB_LEDDRV_IBIAS_UMSK         (~(((1U << GLB_LEDDRV_IBIAS_LEN) - 1) << GLB_LEDDRV_IBIAS_POS))
#define GLB_IR_RX_GPIO_SEL            GLB_IR_RX_GPIO_SEL
#define GLB_IR_RX_GPIO_SEL_POS        (8U)
#define GLB_IR_RX_GPIO_SEL_LEN        (4U)
#define GLB_IR_RX_GPIO_SEL_MSK        (((1U << GLB_IR_RX_GPIO_SEL_LEN) - 1) << GLB_IR_RX_GPIO_SEL_POS)
#define GLB_IR_RX_GPIO_SEL_UMSK       (~(((1U << GLB_IR_RX_GPIO_SEL_LEN) - 1) << GLB_IR_RX_GPIO_SEL_POS))
#define GLB_LEDDRV_OUT_EN             GLB_LEDDRV_OUT_EN
#define GLB_LEDDRV_OUT_EN_POS         (28U)
#define GLB_LEDDRV_OUT_EN_LEN         (2U)
#define GLB_LEDDRV_OUT_EN_MSK         (((1U << GLB_LEDDRV_OUT_EN_LEN) - 1) << GLB_LEDDRV_OUT_EN_POS)
#define GLB_LEDDRV_OUT_EN_UMSK        (~(((1U << GLB_LEDDRV_OUT_EN_LEN) - 1) << GLB_LEDDRV_OUT_EN_POS))
#define GLB_PU_LEDDRV                 GLB_PU_LEDDRV
#define GLB_PU_LEDDRV_POS             (31U)
#define GLB_PU_LEDDRV_LEN             (1U)
#define GLB_PU_LEDDRV_MSK             (((1U << GLB_PU_LEDDRV_LEN) - 1) << GLB_PU_LEDDRV_POS)
#define GLB_PU_LEDDRV_UMSK            (~(((1U << GLB_PU_LEDDRV_LEN) - 1) << GLB_PU_LEDDRV_POS))

/* 0x228 : usb_xcvr */
#define GLB_USB_XCVR_OFFSET       (0x228)
#define GLB_USB_LDO_VFB           GLB_USB_LDO_VFB
#define GLB_USB_LDO_VFB_POS       (0U)
#define GLB_USB_LDO_VFB_LEN       (3U)
#define GLB_USB_LDO_VFB_MSK       (((1U << GLB_USB_LDO_VFB_LEN) - 1) << GLB_USB_LDO_VFB_POS)
#define GLB_USB_LDO_VFB_UMSK      (~(((1U << GLB_USB_LDO_VFB_LEN) - 1) << GLB_USB_LDO_VFB_POS))
#define GLB_PU_USB_LDO            GLB_PU_USB_LDO
#define GLB_PU_USB_LDO_POS        (3U)
#define GLB_PU_USB_LDO_LEN        (1U)
#define GLB_PU_USB_LDO_MSK        (((1U << GLB_PU_USB_LDO_LEN) - 1) << GLB_PU_USB_LDO_POS)
#define GLB_PU_USB_LDO_UMSK       (~(((1U << GLB_PU_USB_LDO_LEN) - 1) << GLB_PU_USB_LDO_POS))
#define GLB_USB_ROUT_NMOS         GLB_USB_ROUT_NMOS
#define GLB_USB_ROUT_NMOS_POS     (4U)
#define GLB_USB_ROUT_NMOS_LEN     (3U)
#define GLB_USB_ROUT_NMOS_MSK     (((1U << GLB_USB_ROUT_NMOS_LEN) - 1) << GLB_USB_ROUT_NMOS_POS)
#define GLB_USB_ROUT_NMOS_UMSK    (~(((1U << GLB_USB_ROUT_NMOS_LEN) - 1) << GLB_USB_ROUT_NMOS_POS))
#define GLB_USB_ROUT_PMOS         GLB_USB_ROUT_PMOS
#define GLB_USB_ROUT_PMOS_POS     (8U)
#define GLB_USB_ROUT_PMOS_LEN     (3U)
#define GLB_USB_ROUT_PMOS_MSK     (((1U << GLB_USB_ROUT_PMOS_LEN) - 1) << GLB_USB_ROUT_PMOS_POS)
#define GLB_USB_ROUT_PMOS_UMSK    (~(((1U << GLB_USB_ROUT_PMOS_LEN) - 1) << GLB_USB_ROUT_PMOS_POS))
#define GLB_USB_OEB_SEL           GLB_USB_OEB_SEL
#define GLB_USB_OEB_SEL_POS       (12U)
#define GLB_USB_OEB_SEL_LEN       (1U)
#define GLB_USB_OEB_SEL_MSK       (((1U << GLB_USB_OEB_SEL_LEN) - 1) << GLB_USB_OEB_SEL_POS)
#define GLB_USB_OEB_SEL_UMSK      (~(((1U << GLB_USB_OEB_SEL_LEN) - 1) << GLB_USB_OEB_SEL_POS))
#define GLB_USB_OEB_REG           GLB_USB_OEB_REG
#define GLB_USB_OEB_REG_POS       (13U)
#define GLB_USB_OEB_REG_LEN       (1U)
#define GLB_USB_OEB_REG_MSK       (((1U << GLB_USB_OEB_REG_LEN) - 1) << GLB_USB_OEB_REG_POS)
#define GLB_USB_OEB_REG_UMSK      (~(((1U << GLB_USB_OEB_REG_LEN) - 1) << GLB_USB_OEB_REG_POS))
#define GLB_USB_OEB               GLB_USB_OEB
#define GLB_USB_OEB_POS           (14U)
#define GLB_USB_OEB_LEN           (1U)
#define GLB_USB_OEB_MSK           (((1U << GLB_USB_OEB_LEN) - 1) << GLB_USB_OEB_POS)
#define GLB_USB_OEB_UMSK          (~(((1U << GLB_USB_OEB_LEN) - 1) << GLB_USB_OEB_POS))
#define GLB_USB_DATA_CONVERT      GLB_USB_DATA_CONVERT
#define GLB_USB_DATA_CONVERT_POS  (16U)
#define GLB_USB_DATA_CONVERT_LEN  (1U)
#define GLB_USB_DATA_CONVERT_MSK  (((1U << GLB_USB_DATA_CONVERT_LEN) - 1) << GLB_USB_DATA_CONVERT_POS)
#define GLB_USB_DATA_CONVERT_UMSK (~(((1U << GLB_USB_DATA_CONVERT_LEN) - 1) << GLB_USB_DATA_CONVERT_POS))
#define GLB_USB_ENUM              GLB_USB_ENUM
#define GLB_USB_ENUM_POS          (20U)
#define GLB_USB_ENUM_LEN          (1U)
#define GLB_USB_ENUM_MSK          (((1U << GLB_USB_ENUM_LEN) - 1) << GLB_USB_ENUM_POS)
#define GLB_USB_ENUM_UMSK         (~(((1U << GLB_USB_ENUM_LEN) - 1) << GLB_USB_ENUM_POS))
#define GLB_USB_SPD               GLB_USB_SPD
#define GLB_USB_SPD_POS           (21U)
#define GLB_USB_SPD_LEN           (1U)
#define GLB_USB_SPD_MSK           (((1U << GLB_USB_SPD_LEN) - 1) << GLB_USB_SPD_POS)
#define GLB_USB_SPD_UMSK          (~(((1U << GLB_USB_SPD_LEN) - 1) << GLB_USB_SPD_POS))
#define GLB_USB_SUS               GLB_USB_SUS
#define GLB_USB_SUS_POS           (22U)
#define GLB_USB_SUS_LEN           (1U)
#define GLB_USB_SUS_MSK           (((1U << GLB_USB_SUS_LEN) - 1) << GLB_USB_SUS_POS)
#define GLB_USB_SUS_UMSK          (~(((1U << GLB_USB_SUS_LEN) - 1) << GLB_USB_SUS_POS))
#define GLB_PU_USB                GLB_PU_USB
#define GLB_PU_USB_POS            (23U)
#define GLB_PU_USB_LEN            (1U)
#define GLB_PU_USB_MSK            (((1U << GLB_PU_USB_LEN) - 1) << GLB_PU_USB_POS)
#define GLB_PU_USB_UMSK           (~(((1U << GLB_PU_USB_LEN) - 1) << GLB_PU_USB_POS))
#define GLB_USB_BD                GLB_USB_BD
#define GLB_USB_BD_POS            (24U)
#define GLB_USB_BD_LEN            (1U)
#define GLB_USB_BD_MSK            (((1U << GLB_USB_BD_LEN) - 1) << GLB_USB_BD_POS)
#define GLB_USB_BD_UMSK           (~(((1U << GLB_USB_BD_LEN) - 1) << GLB_USB_BD_POS))
#define GLB_USB_VIM               GLB_USB_VIM
#define GLB_USB_VIM_POS           (25U)
#define GLB_USB_VIM_LEN           (1U)
#define GLB_USB_VIM_MSK           (((1U << GLB_USB_VIM_LEN) - 1) << GLB_USB_VIM_POS)
#define GLB_USB_VIM_UMSK          (~(((1U << GLB_USB_VIM_LEN) - 1) << GLB_USB_VIM_POS))
#define GLB_USB_VIP               GLB_USB_VIP
#define GLB_USB_VIP_POS           (26U)
#define GLB_USB_VIP_LEN           (1U)
#define GLB_USB_VIP_MSK           (((1U << GLB_USB_VIP_LEN) - 1) << GLB_USB_VIP_POS)
#define GLB_USB_VIP_UMSK          (~(((1U << GLB_USB_VIP_LEN) - 1) << GLB_USB_VIP_POS))
#define GLB_USB_RCV               GLB_USB_RCV
#define GLB_USB_RCV_POS           (27U)
#define GLB_USB_RCV_LEN           (1U)
#define GLB_USB_RCV_MSK           (((1U << GLB_USB_RCV_LEN) - 1) << GLB_USB_RCV_POS)
#define GLB_USB_RCV_UMSK          (~(((1U << GLB_USB_RCV_LEN) - 1) << GLB_USB_RCV_POS))

