RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl702/std/include/hardware/glb_reg.h
/* 0x22C : usb_xcvr_config */
#define GLB_USB_XCVR_CONFIG_OFFSET   (0x22C)
#define GLB_USB_V_HYS_M              GLB_USB_V_HYS_M
#define GLB_USB_V_HYS_M_POS          (0U)
#define GLB_USB_V_HYS_M_LEN          (2U)
#define GLB_USB_V_HYS_M_MSK          (((1U << GLB_USB_V_HYS_M_LEN) - 1) << GLB_USB_V_HYS_M_POS)
#define GLB_USB_V_HYS_M_UMSK         (~(((1U << GLB_USB_V_HYS_M_LEN) - 1) << GLB_USB_V_HYS_M_POS))
#define GLB_USB_V_HYS_P              GLB_USB_V_HYS_P
#define GLB_USB_V_HYS_P_POS          (2U)
#define GLB_USB_V_HYS_P_LEN          (2U)
#define GLB_USB_V_HYS_P_MSK          (((1U << GLB_USB_V_HYS_P_LEN) - 1) << GLB_USB_V_HYS_P_POS)
#define GLB_USB_V_HYS_P_UMSK         (~(((1U << GLB_USB_V_HYS_P_LEN) - 1) << GLB_USB_V_HYS_P_POS))
#define GLB_USB_BD_VTH               GLB_USB_BD_VTH
#define GLB_USB_BD_VTH_POS           (4U)
#define GLB_USB_BD_VTH_LEN           (3U)
#define GLB_USB_BD_VTH_MSK           (((1U << GLB_USB_BD_VTH_LEN) - 1) << GLB_USB_BD_VTH_POS)
#define GLB_USB_BD_VTH_UMSK          (~(((1U << GLB_USB_BD_VTH_LEN) - 1) << GLB_USB_BD_VTH_POS))
#define GLB_REG_USB_USE_XCVR         GLB_REG_USB_USE_XCVR
#define GLB_REG_USB_USE_XCVR_POS     (7U)
#define GLB_REG_USB_USE_XCVR_LEN     (1U)
#define GLB_REG_USB_USE_XCVR_MSK     (((1U << GLB_REG_USB_USE_XCVR_LEN) - 1) << GLB_REG_USB_USE_XCVR_POS)
#define GLB_REG_USB_USE_XCVR_UMSK    (~(((1U << GLB_REG_USB_USE_XCVR_LEN) - 1) << GLB_REG_USB_USE_XCVR_POS))
#define GLB_USB_STR_DRV              GLB_USB_STR_DRV
#define GLB_USB_STR_DRV_POS          (8U)
#define GLB_USB_STR_DRV_LEN          (3U)
#define GLB_USB_STR_DRV_MSK          (((1U << GLB_USB_STR_DRV_LEN) - 1) << GLB_USB_STR_DRV_POS)
#define GLB_USB_STR_DRV_UMSK         (~(((1U << GLB_USB_STR_DRV_LEN) - 1) << GLB_USB_STR_DRV_POS))
#define GLB_REG_USB_USE_CTRL         GLB_REG_USB_USE_CTRL
#define GLB_REG_USB_USE_CTRL_POS     (11U)
#define GLB_REG_USB_USE_CTRL_LEN     (1U)
#define GLB_REG_USB_USE_CTRL_MSK     (((1U << GLB_REG_USB_USE_CTRL_LEN) - 1) << GLB_REG_USB_USE_CTRL_POS)
#define GLB_REG_USB_USE_CTRL_UMSK    (~(((1U << GLB_REG_USB_USE_CTRL_LEN) - 1) << GLB_REG_USB_USE_CTRL_POS))
#define GLB_USB_RES_PULLUP_TUNE      GLB_USB_RES_PULLUP_TUNE
#define GLB_USB_RES_PULLUP_TUNE_POS  (12U)
#define GLB_USB_RES_PULLUP_TUNE_LEN  (3U)
#define GLB_USB_RES_PULLUP_TUNE_MSK  (((1U << GLB_USB_RES_PULLUP_TUNE_LEN) - 1) << GLB_USB_RES_PULLUP_TUNE_POS)
#define GLB_USB_RES_PULLUP_TUNE_UMSK (~(((1U << GLB_USB_RES_PULLUP_TUNE_LEN) - 1) << GLB_USB_RES_PULLUP_TUNE_POS))
#define GLB_USB_SLEWRATE_M_FALL      GLB_USB_SLEWRATE_M_FALL
#define GLB_USB_SLEWRATE_M_FALL_POS  (16U)
#define GLB_USB_SLEWRATE_M_FALL_LEN  (3U)
#define GLB_USB_SLEWRATE_M_FALL_MSK  (((1U << GLB_USB_SLEWRATE_M_FALL_LEN) - 1) << GLB_USB_SLEWRATE_M_FALL_POS)
#define GLB_USB_SLEWRATE_M_FALL_UMSK (~(((1U << GLB_USB_SLEWRATE_M_FALL_LEN) - 1) << GLB_USB_SLEWRATE_M_FALL_POS))
#define GLB_USB_SLEWRATE_M_RISE      GLB_USB_SLEWRATE_M_RISE
#define GLB_USB_SLEWRATE_M_RISE_POS  (20U)
#define GLB_USB_SLEWRATE_M_RISE_LEN  (3U)
#define GLB_USB_SLEWRATE_M_RISE_MSK  (((1U << GLB_USB_SLEWRATE_M_RISE_LEN) - 1) << GLB_USB_SLEWRATE_M_RISE_POS)
#define GLB_USB_SLEWRATE_M_RISE_UMSK (~(((1U << GLB_USB_SLEWRATE_M_RISE_LEN) - 1) << GLB_USB_SLEWRATE_M_RISE_POS))
#define GLB_USB_SLEWRATE_P_FALL      GLB_USB_SLEWRATE_P_FALL
#define GLB_USB_SLEWRATE_P_FALL_POS  (24U)
#define GLB_USB_SLEWRATE_P_FALL_LEN  (3U)
#define GLB_USB_SLEWRATE_P_FALL_MSK  (((1U << GLB_USB_SLEWRATE_P_FALL_LEN) - 1) << GLB_USB_SLEWRATE_P_FALL_POS)
#define GLB_USB_SLEWRATE_P_FALL_UMSK (~(((1U << GLB_USB_SLEWRATE_P_FALL_LEN) - 1) << GLB_USB_SLEWRATE_P_FALL_POS))
#define GLB_USB_SLEWRATE_P_RISE      GLB_USB_SLEWRATE_P_RISE
#define GLB_USB_SLEWRATE_P_RISE_POS  (28U)
#define GLB_USB_SLEWRATE_P_RISE_LEN  (3U)
#define GLB_USB_SLEWRATE_P_RISE_MSK  (((1U << GLB_USB_SLEWRATE_P_RISE_LEN) - 1) << GLB_USB_SLEWRATE_P_RISE_POS)
#define GLB_USB_SLEWRATE_P_RISE_UMSK (~(((1U << GLB_USB_SLEWRATE_P_RISE_LEN) - 1) << GLB_USB_SLEWRATE_P_RISE_POS))

/* 0x308 : gpdac_ctrl */
#define GLB_GPDAC_CTRL_OFFSET    (0x308)
#define GLB_GPDACA_RSTN_ANA      GLB_GPDACA_RSTN_ANA
#define GLB_GPDACA_RSTN_ANA_POS  (0U)
#define GLB_GPDACA_RSTN_ANA_LEN  (1U)
#define GLB_GPDACA_RSTN_ANA_MSK  (((1U << GLB_GPDACA_RSTN_ANA_LEN) - 1) << GLB_GPDACA_RSTN_ANA_POS)
#define GLB_GPDACA_RSTN_ANA_UMSK (~(((1U << GLB_GPDACA_RSTN_ANA_LEN) - 1) << GLB_GPDACA_RSTN_ANA_POS))
#define GLB_GPDACB_RSTN_ANA      GLB_GPDACB_RSTN_ANA
#define GLB_GPDACB_RSTN_ANA_POS  (1U)
#define GLB_GPDACB_RSTN_ANA_LEN  (1U)
#define GLB_GPDACB_RSTN_ANA_MSK  (((1U << GLB_GPDACB_RSTN_ANA_LEN) - 1) << GLB_GPDACB_RSTN_ANA_POS)
#define GLB_GPDACB_RSTN_ANA_UMSK (~(((1U << GLB_GPDACB_RSTN_ANA_LEN) - 1) << GLB_GPDACB_RSTN_ANA_POS))
#define GLB_GPDAC_TEST_EN        GLB_GPDAC_TEST_EN
#define GLB_GPDAC_TEST_EN_POS    (7U)
#define GLB_GPDAC_TEST_EN_LEN    (1U)
#define GLB_GPDAC_TEST_EN_MSK    (((1U << GLB_GPDAC_TEST_EN_LEN) - 1) << GLB_GPDAC_TEST_EN_POS)
#define GLB_GPDAC_TEST_EN_UMSK   (~(((1U << GLB_GPDAC_TEST_EN_LEN) - 1) << GLB_GPDAC_TEST_EN_POS))
#define GLB_GPDAC_REF_SEL        GLB_GPDAC_REF_SEL
#define GLB_GPDAC_REF_SEL_POS    (8U)
#define GLB_GPDAC_REF_SEL_LEN    (1U)
#define GLB_GPDAC_REF_SEL_MSK    (((1U << GLB_GPDAC_REF_SEL_LEN) - 1) << GLB_GPDAC_REF_SEL_POS)
#define GLB_GPDAC_REF_SEL_UMSK   (~(((1U << GLB_GPDAC_REF_SEL_LEN) - 1) << GLB_GPDAC_REF_SEL_POS))
#define GLB_GPDAC_TEST_SEL       GLB_GPDAC_TEST_SEL
#define GLB_GPDAC_TEST_SEL_POS   (9U)
#define GLB_GPDAC_TEST_SEL_LEN   (3U)
#define GLB_GPDAC_TEST_SEL_MSK   (((1U << GLB_GPDAC_TEST_SEL_LEN) - 1) << GLB_GPDAC_TEST_SEL_POS)
#define GLB_GPDAC_TEST_SEL_UMSK  (~(((1U << GLB_GPDAC_TEST_SEL_LEN) - 1) << GLB_GPDAC_TEST_SEL_POS))
#define GLB_GPDAC_RESERVED       GLB_GPDAC_RESERVED
#define GLB_GPDAC_RESERVED_POS   (24U)
#define GLB_GPDAC_RESERVED_LEN   (8U)
#define GLB_GPDAC_RESERVED_MSK   (((1U << GLB_GPDAC_RESERVED_LEN) - 1) << GLB_GPDAC_RESERVED_POS)
#define GLB_GPDAC_RESERVED_UMSK  (~(((1U << GLB_GPDAC_RESERVED_LEN) - 1) << GLB_GPDAC_RESERVED_POS))

