RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl702/std/include/hardware/glb_reg.h
    /* 0x54 : bmx_cfg2 */
    union {
        struct
        {
            uint32_t bmx_err_addr_dis : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_3     : 3;  /* [ 3: 1],       rsvd,        0x0 */
            uint32_t bmx_err_dec      : 1;  /* [    4],          r,        0x0 */
            uint32_t bmx_err_tz       : 1;  /* [    5],          r,        0x0 */
            uint32_t reserved_6_7     : 2;  /* [ 7: 6],       rsvd,        0x0 */
            uint32_t reg_w_thre_bmx   : 2;  /* [ 9: 8],        r/w,        0x0 */
            uint32_t reg_w_thre_l1c   : 2;  /* [11:10],        r/w,        0x0 */
            uint32_t reserved_12_27   : 16; /* [27:12],       rsvd,        0x0 */
            uint32_t bmx_dbg_sel      : 4;  /* [31:28],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } bmx_cfg2;

    /* 0x58 : bmx_err_addr */
    union {
        struct
        {
            uint32_t bmx_err_addr : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } bmx_err_addr;

    /* 0x5C : bmx_dbg_out */
    union {
        struct
        {
            uint32_t bmx_dbg_out : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } bmx_dbg_out;

    /* 0x60 : rsv0 */
    union {
        struct
        {
            uint32_t rsvd_31_0 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rsv0;

    /* 0x64 : rsv1 */
    union {
        struct
        {
            uint32_t rsvd_31_0 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rsv1;

    /* 0x68 : rsv2 */
    union {
        struct
        {
            uint32_t rsvd_31_0 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rsv2;

    /* 0x6C : rsv3 */
    union {
        struct
        {
            uint32_t rsvd_31_0 : 32; /* [31: 0],       rsvd, 0xffffffffL */
        } BF;
        uint32_t WORD;
    } rsv3;

    /* 0x70 : sram_ret */
    union {
        struct
        {
            uint32_t reg_sram_ret : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sram_ret;

    /* 0x74 : sram_slp */
    union {
        struct
        {
            uint32_t reg_sram_slp : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sram_slp;

    /* 0x78 : sram_parm */
    union {
        struct
        {
            uint32_t reg_sram_parm : 32; /* [31: 0],        r/w, 0x6a4c0c0c */
        } BF;
        uint32_t WORD;
    } sram_parm;

    /* 0x7C : seam_misc */
    union {
        struct
        {
            uint32_t em_sel        : 4;  /* [ 3: 0],        r/w,        0x3 */
            uint32_t reserved_4_31 : 28; /* [31: 4],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } seam_misc;

    /* 0x80 : glb_parm */
    union {
        struct
        {
            uint32_t jtag_swap_set            : 8; /* [ 7: 0],        r/w,        0x4 */
            uint32_t cfg_sflash2_swap_io0_io3 : 1; /* [    8],        r/w,        0x0 */
            uint32_t cfg_sflash2_swap_cs_io2  : 1; /* [    9],        r/w,        0x0 */
            uint32_t cfg_flash_scenario       : 2; /* [11:10],        r/w,        0x0 */
            uint32_t reg_spi_0_master_mode    : 1; /* [   12],        r/w,        0x0 */
            uint32_t reg_spi_0_swap           : 1; /* [   13],        r/w,        0x0 */
            uint32_t reserved_14_15           : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t reg_cci_use_jtag_pin     : 1; /* [   16],        r/w,        0x1 */
            uint32_t p1_adc_test_with_cci     : 1; /* [   17],        r/w,        0x0 */
            uint32_t p2_dac_test_with_cci     : 1; /* [   18],        r/w,        0x0 */
            uint32_t p3_cci_use_io_0_2_7      : 1; /* [   19],        r/w,        0x0 */
            uint32_t p4_adc_test_with_jtag    : 1; /* [   20],        r/w,        0x0 */
            uint32_t p5_dac_test_with_jtag    : 1; /* [   21],        r/w,        0x0 */
            uint32_t reserved_22              : 1; /* [   22],       rsvd,        0x0 */
            uint32_t p6_jtag_use_io_0_2_7     : 1; /* [   23],        r/w,        0x0 */
            uint32_t uart_swap_set            : 4; /* [27:24],        r/w,        0x0 */
            uint32_t reserved_28              : 1; /* [   28],       rsvd,        0x0 */
            uint32_t reg_kys_drv_val          : 1; /* [   29],        r/w,        0x0 */
            uint32_t reg_ext_rst_smt          : 1; /* [   30],        r/w,        0x0 */
            uint32_t pin_sel_emac_cam         : 1; /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } glb_parm;

    /* 0x84 : PDM_CLK_CTRL */
    union {
        struct
        {
            uint32_t reg_pdm0_clk_div : 6;  /* [ 5: 0],        r/w,        0x1 */
            uint32_t reserved_6       : 1;  /* [    6],       rsvd,        0x0 */
            uint32_t reg_pdm0_clk_en  : 1;  /* [    7],        r/w,        0x1 */
            uint32_t reserved_8_31    : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } PDM_CLK_CTRL;

    /* 0x88 : GPIO_USE_PSRAM__IO */
    union {
        struct
        {
            uint32_t cfg_gpio_use_psram_io : 6;  /* [ 5: 0],        r/w,        0x0 */
            uint32_t reserved_6_31         : 26; /* [31: 6],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_USE_PSRAM__IO;

    /* 0x8c  reserved */
    uint8_t RESERVED0x8c[4];

    /* 0x90 : CPU_CLK_CFG */
    union {
        struct
        {
            uint32_t cpu_rtc_div        : 17; /* [16: 0],        r/w,       0x10 */
            uint32_t reserved_17        : 1;  /* [   17],       rsvd,        0x0 */
            uint32_t cpu_rtc_en         : 1;  /* [   18],        r/w,        0x0 */
            uint32_t cpu_rtc_sel        : 1;  /* [   19],        r/w,        0x1 */
            uint32_t debug_ndreset_gate : 1;  /* [   20],        r/w,        0x0 */
            uint32_t reserved_21_31     : 11; /* [31:21],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } CPU_CLK_CFG;

    /* 0x94  reserved */
    uint8_t RESERVED0x94[16];

    /* 0xA4 : GPADC_32M_SRC_CTRL */
    union {
        struct
        {
            uint32_t gpadc_32m_clk_div : 6;  /* [ 5: 0],        r/w,        0x2 */
            uint32_t reserved_6        : 1;  /* [    6],       rsvd,        0x0 */
            uint32_t gpadc_32m_clk_sel : 1;  /* [    7],        r/w,        0x0 */
            uint32_t gpadc_32m_div_en  : 1;  /* [    8],        r/w,        0x1 */
            uint32_t reserved_9_31     : 23; /* [31: 9],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GPADC_32M_SRC_CTRL;

