RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl702/std/include/hardware/glb_reg.h
    /* 0xA8 : DIG32K_WAKEUP_CTRL */
    union {
        struct
        {
            uint32_t dig_32k_div            : 11; /* [10: 0],        r/w,      0x3e8 */
            uint32_t reserved_11            : 1;  /* [   11],       rsvd,        0x0 */
            uint32_t dig_32k_en             : 1;  /* [   12],        r/w,        0x1 */
            uint32_t dig_32k_comp           : 1;  /* [   13],        r/w,        0x0 */
            uint32_t reserved_14_15         : 2;  /* [15:14],       rsvd,        0x0 */
            uint32_t dig_512k_div           : 7;  /* [22:16],        r/w,       0x3e */
            uint32_t reserved_23            : 1;  /* [   23],       rsvd,        0x0 */
            uint32_t dig_512k_en            : 1;  /* [   24],        r/w,        0x1 */
            uint32_t dig_512k_comp          : 1;  /* [   25],        r/w,        0x1 */
            uint32_t reserved_26_27         : 2;  /* [27:26],       rsvd,        0x0 */
            uint32_t dig_clk_src_sel        : 2;  /* [29:28],        r/w,        0x0 */
            uint32_t reserved_30            : 1;  /* [   30],       rsvd,        0x0 */
            uint32_t reg_en_platform_wakeup : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DIG32K_WAKEUP_CTRL;

    /* 0xAC : WIFI_BT_COEX_CTRL */
    union {
        struct
        {
            uint32_t coex_bt_channel : 7;  /* [ 6: 0],        r/w,        0x0 */
            uint32_t coex_bt_pti     : 4;  /* [10: 7],        r/w,        0x0 */
            uint32_t coex_bt_bw      : 1;  /* [   11],        r/w,        0x0 */
            uint32_t en_gpio_bt_coex : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31  : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WIFI_BT_COEX_CTRL;

    /* 0xB0 : BZ_COEX_CTRL */
    union {
        struct
        {
            uint32_t coex_en           : 1; /* [    0],        r/w,        0x0 */
            uint32_t wlan_en           : 1; /* [    1],        r/w,        0x0 */
            uint32_t ble_rx_ignore     : 1; /* [    2],        r/w,        0x0 */
            uint32_t m154_rx_ignore    : 1; /* [    3],        r/w,        0x0 */
            uint32_t bz_pri_thr        : 4; /* [ 7: 4],        r/w,        0x0 */
            uint32_t bz_pri_en         : 1; /* [    8],        r/w,        0x1 */
            uint32_t bz_pri_pol        : 1; /* [    9],        r/w,        0x1 */
            uint32_t bz_active_pol     : 1; /* [   10],        r/w,        0x1 */
            uint32_t bz_abort_pol      : 1; /* [   11],        r/w,        0x1 */
            uint32_t coex_pri          : 1; /* [   12],        r/w,        0x0 */
            uint32_t force_m154_win    : 1; /* [   13],        r/w,        0x0 */
            uint32_t force_ble_win     : 1; /* [   14],        r/w,        0x0 */
            uint32_t coex_option       : 1; /* [   15],        r/w,        0x0 */
            uint32_t coex_force_ch     : 7; /* [22:16],        r/w,        0x4 */
            uint32_t reserved_23       : 1; /* [   23],       rsvd,        0x0 */
            uint32_t m154_rx_abort_dis : 1; /* [   24],        r/w,        0x0 */
            uint32_t m154_tx_abort_dis : 1; /* [   25],        r/w,        0x0 */
            uint32_t ble_rx_abort_dis  : 1; /* [   26],        r/w,        0x0 */
            uint32_t ble_tx_abort_dis  : 1; /* [   27],        r/w,        0x0 */
            uint32_t coex_arb          : 4; /* [31:28],          r,        0x8 */
        } BF;
        uint32_t WORD;
    } BZ_COEX_CTRL;

    /* 0xb4  reserved */
    uint8_t RESERVED0xb4[12];

    /* 0xC0 : UART_SIG_SEL_0 */
    union {
        struct
        {
            uint32_t uart_sig_0_sel : 4; /* [ 3: 0],        r/w,        0x0 */
            uint32_t uart_sig_1_sel : 4; /* [ 7: 4],        r/w,        0x1 */
            uint32_t uart_sig_2_sel : 4; /* [11: 8],        r/w,        0x2 */
            uint32_t uart_sig_3_sel : 4; /* [15:12],        r/w,        0x3 */
            uint32_t uart_sig_4_sel : 4; /* [19:16],        r/w,        0x4 */
            uint32_t uart_sig_5_sel : 4; /* [23:20],        r/w,        0x5 */
            uint32_t uart_sig_6_sel : 4; /* [27:24],        r/w,        0x6 */
            uint32_t uart_sig_7_sel : 4; /* [31:28],        r/w,        0x7 */
        } BF;
        uint32_t WORD;
    } UART_SIG_SEL_0;

    /* 0xc4  reserved */
    uint8_t RESERVED0xc4[12];

    /* 0xD0 : DBG_SEL_LL */
    union {
        struct
        {
            uint32_t reg_dbg_ll_ctrl : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DBG_SEL_LL;

    /* 0xD4 : DBG_SEL_LH */
    union {
        struct
        {
            uint32_t reg_dbg_lh_ctrl : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DBG_SEL_LH;

    /* 0xD8 : DBG_SEL_HL */
    union {
        struct
        {
            uint32_t reg_dbg_hl_ctrl : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DBG_SEL_HL;

    /* 0xDC : DBG_SEL_HH */
    union {
        struct
        {
            uint32_t reg_dbg_hh_ctrl : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DBG_SEL_HH;

    /* 0xE0 : debug */
    union {
        struct
        {
            uint32_t debug_oe : 1;  /* [    0],        r/w,        0x0 */
            uint32_t debug_i  : 31; /* [31: 1],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } debug;

    /* 0xe4  reserved */
    uint8_t RESERVED0xe4[28];

    /* 0x100 : GPIO_CFGCTL0 */
    union {
        struct
        {
            uint32_t reg_gpio_0_ie       : 1; /* [    0],        r/w,        0x1 */
            uint32_t reg_gpio_0_smt      : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_0_drv      : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_0_pu       : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_0_pd       : 1; /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_7        : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t reg_gpio_0_func_sel : 5; /* [12: 8],        r/w,        0xe */
            uint32_t reserved_13_15      : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_1_ie       : 1; /* [   16],        r/w,        0x1 */
            uint32_t reg_gpio_1_smt      : 1; /* [   17],        r/w,        0x1 */
            uint32_t reg_gpio_1_drv      : 2; /* [19:18],        r/w,        0x0 */
            uint32_t reg_gpio_1_pu       : 1; /* [   20],        r/w,        0x0 */
            uint32_t reg_gpio_1_pd       : 1; /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_23      : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t reg_gpio_1_func_sel : 5; /* [28:24],        r/w,        0xe */
            uint32_t reserved_29_31      : 3; /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_CFGCTL0;

    /* 0x104 : GPIO_CFGCTL1 */
    union {
        struct
        {
            uint32_t reg_gpio_2_ie       : 1; /* [    0],        r/w,        0x1 */
            uint32_t reg_gpio_2_smt      : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_2_drv      : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_2_pu       : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_2_pd       : 1; /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_7        : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t reg_gpio_2_func_sel : 5; /* [12: 8],        r/w,        0xe */
            uint32_t reserved_13_15      : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_3_ie       : 1; /* [   16],        r/w,        0x1 */
            uint32_t reg_gpio_3_smt      : 1; /* [   17],        r/w,        0x1 */
            uint32_t reg_gpio_3_drv      : 2; /* [19:18],        r/w,        0x0 */
            uint32_t reg_gpio_3_pu       : 1; /* [   20],        r/w,        0x0 */
            uint32_t reg_gpio_3_pd       : 1; /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_23      : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t reg_gpio_3_func_sel : 5; /* [28:24],        r/w,        0xb */
            uint32_t reserved_29_31      : 3; /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_CFGCTL1;

    /* 0x108 : GPIO_CFGCTL2 */
    union {
        struct
        {
            uint32_t reg_gpio_4_ie       : 1; /* [    0],        r/w,        0x1 */
            uint32_t reg_gpio_4_smt      : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_4_drv      : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_4_pu       : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_4_pd       : 1; /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_7        : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t reg_gpio_4_func_sel : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15      : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_5_ie       : 1; /* [   16],        r/w,        0x1 */
            uint32_t reg_gpio_5_smt      : 1; /* [   17],        r/w,        0x1 */
            uint32_t reg_gpio_5_drv      : 2; /* [19:18],        r/w,        0x0 */
            uint32_t reg_gpio_5_pu       : 1; /* [   20],        r/w,        0x0 */
            uint32_t reg_gpio_5_pd       : 1; /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_23      : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t reg_gpio_5_func_sel : 5; /* [28:24],        r/w,        0xb */
            uint32_t reserved_29_31      : 3; /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_CFGCTL2;

    /* 0x10C : GPIO_CFGCTL3 */
    union {
        struct
        {
            uint32_t reg_gpio_6_ie       : 1; /* [    0],        r/w,        0x1 */
            uint32_t reg_gpio_6_smt      : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_6_drv      : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_6_pu       : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_6_pd       : 1; /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_7        : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t reg_gpio_6_func_sel : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15      : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_7_ie       : 1; /* [   16],        r/w,        0x1 */
            uint32_t reg_gpio_7_smt      : 1; /* [   17],        r/w,        0x1 */
            uint32_t reg_gpio_7_drv      : 2; /* [19:18],        r/w,        0x0 */
            uint32_t reg_gpio_7_pu       : 1; /* [   20],        r/w,        0x0 */
            uint32_t reg_gpio_7_pd       : 1; /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_23      : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t reg_gpio_7_func_sel : 5; /* [28:24],        r/w,        0xb */
            uint32_t reserved_29_31      : 3; /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_CFGCTL3;

    /* 0x110 : GPIO_CFGCTL4 */
    union {
        struct
        {
            uint32_t reg_gpio_8_ie       : 1; /* [    0],        r/w,        0x1 */
            uint32_t reg_gpio_8_smt      : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_8_drv      : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_8_pu       : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_8_pd       : 1; /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_7        : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t reg_gpio_8_func_sel : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15      : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_9_ie       : 1; /* [   16],        r/w,        0x0 */
            uint32_t reg_gpio_9_smt      : 1; /* [   17],        r/w,        0x1 */
            uint32_t reg_gpio_9_drv      : 2; /* [19:18],        r/w,        0x0 */
            uint32_t reg_gpio_9_pu       : 1; /* [   20],        r/w,        0x0 */
            uint32_t reg_gpio_9_pd       : 1; /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_23      : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t reg_gpio_9_func_sel : 5; /* [28:24],        r/w,        0xe */
            uint32_t reserved_29_31      : 3; /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_CFGCTL4;

    /* 0x114 : GPIO_CFGCTL5 */
    union {
        struct
        {
            uint32_t reg_gpio_10_ie       : 1; /* [    0],        r/w,        0x1 */
            uint32_t reg_gpio_10_smt      : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_10_drv      : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_10_pu       : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_10_pd       : 1; /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_7         : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t reg_gpio_10_func_sel : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15       : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_11_ie       : 1; /* [   16],        r/w,        0x1 */
            uint32_t reg_gpio_11_smt      : 1; /* [   17],        r/w,        0x1 */
            uint32_t reg_gpio_11_drv      : 2; /* [19:18],        r/w,        0x0 */
            uint32_t reg_gpio_11_pu       : 1; /* [   20],        r/w,        0x0 */
            uint32_t reg_gpio_11_pd       : 1; /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_23       : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t reg_gpio_11_func_sel : 5; /* [28:24],        r/w,        0xb */
            uint32_t reserved_29_31       : 3; /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_CFGCTL5;

    /* 0x118 : GPIO_CFGCTL6 */
    union {
        struct
        {
            uint32_t reg_gpio_12_ie       : 1; /* [    0],        r/w,        0x1 */
            uint32_t reg_gpio_12_smt      : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_12_drv      : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_12_pu       : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_12_pd       : 1; /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_7         : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t reg_gpio_12_func_sel : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15       : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_13_ie       : 1; /* [   16],        r/w,        0x1 */
            uint32_t reg_gpio_13_smt      : 1; /* [   17],        r/w,        0x1 */
            uint32_t reg_gpio_13_drv      : 2; /* [19:18],        r/w,        0x0 */
            uint32_t reg_gpio_13_pu       : 1; /* [   20],        r/w,        0x0 */
            uint32_t reg_gpio_13_pd       : 1; /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_23       : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t reg_gpio_13_func_sel : 5; /* [28:24],        r/w,        0xb */
            uint32_t reserved_29_31       : 3; /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_CFGCTL6;

