RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl702/std/include/hardware/glb_reg.h
    /* 0x130 : GPIO_CFGCTL12 */
    union {
        struct
        {
            uint32_t reg_gpio_24_ie       : 1; /* [    0],        r/w,        0x1 */
            uint32_t reg_gpio_24_smt      : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_24_drv      : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_24_pu       : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_24_pd       : 1; /* [    5],        r/w,        0x1 */
            uint32_t reserved_6_7         : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t reg_gpio_24_func_sel : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15       : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_25_ie       : 1; /* [   16],        r/w,        0x1 */
            uint32_t reg_gpio_25_smt      : 1; /* [   17],        r/w,        0x1 */
            uint32_t reg_gpio_25_drv      : 2; /* [19:18],        r/w,        0x0 */
            uint32_t reg_gpio_25_pu       : 1; /* [   20],        r/w,        0x0 */
            uint32_t reg_gpio_25_pd       : 1; /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_23       : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t reg_gpio_25_func_sel : 5; /* [28:24],        r/w,        0xb */
            uint32_t reserved_29_31       : 3; /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_CFGCTL12;

    /* 0x134 : GPIO_CFGCTL13 */
    union {
        struct
        {
            uint32_t reg_gpio_26_ie       : 1; /* [    0],        r/w,        0x1 */
            uint32_t reg_gpio_26_smt      : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_26_drv      : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_26_pu       : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_26_pd       : 1; /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_7         : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t reg_gpio_26_func_sel : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15       : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_27_ie       : 1; /* [   16],        r/w,        0x1 */
            uint32_t reg_gpio_27_smt      : 1; /* [   17],        r/w,        0x1 */
            uint32_t reg_gpio_27_drv      : 2; /* [19:18],        r/w,        0x0 */
            uint32_t reg_gpio_27_pu       : 1; /* [   20],        r/w,        0x0 */
            uint32_t reg_gpio_27_pd       : 1; /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_23       : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t reg_gpio_27_func_sel : 5; /* [28:24],        r/w,        0xb */
            uint32_t reserved_29_31       : 3; /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_CFGCTL13;

    /* 0x138 : GPIO_CFGCTL14 */
    union {
        struct
        {
            uint32_t reg_gpio_28_ie       : 1; /* [    0],        r/w,        0x1 */
            uint32_t reg_gpio_28_smt      : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_28_drv      : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_28_pu       : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_28_pd       : 1; /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_7         : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t reg_gpio_28_func_sel : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15       : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_29_ie       : 1; /* [   16],        r/w,        0x1 */
            uint32_t reg_gpio_29_smt      : 1; /* [   17],        r/w,        0x1 */
            uint32_t reg_gpio_29_drv      : 2; /* [19:18],        r/w,        0x0 */
            uint32_t reg_gpio_29_pu       : 1; /* [   20],        r/w,        0x0 */
            uint32_t reg_gpio_29_pd       : 1; /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_23       : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t reg_gpio_29_func_sel : 5; /* [28:24],        r/w,        0xb */
            uint32_t reserved_29_31       : 3; /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_CFGCTL14;

    /* 0x13C : GPIO_CFGCTL15 */
    union {
        struct
        {
            uint32_t reg_gpio_30_ie       : 1; /* [    0],        r/w,        0x1 */
            uint32_t reg_gpio_30_smt      : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_30_drv      : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_30_pu       : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_30_pd       : 1; /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_7         : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t reg_gpio_30_func_sel : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15       : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_31_ie       : 1; /* [   16],        r/w,        0x1 */
            uint32_t reg_gpio_31_smt      : 1; /* [   17],        r/w,        0x1 */
            uint32_t reg_gpio_31_drv      : 2; /* [19:18],        r/w,        0x0 */
            uint32_t reg_gpio_31_pu       : 1; /* [   20],        r/w,        0x0 */
            uint32_t reg_gpio_31_pd       : 1; /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_23       : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t reg_gpio_31_func_sel : 5; /* [28:24],        r/w,        0xb */
            uint32_t reserved_29_31       : 3; /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_CFGCTL15;

    /* 0x140 : GPIO_CFGCTL16 */
    union {
        struct
        {
            uint32_t reg_gpio_32_ie  : 1;  /* [    0],        r/w,        0x1 */
            uint32_t reg_gpio_32_smt : 1;  /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_32_drv : 2;  /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_32_pu  : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_32_pd  : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_15   : 10; /* [15: 6],       rsvd,        0x0 */
            uint32_t reg_gpio_33_ie  : 1;  /* [   16],        r/w,        0x1 */
            uint32_t reg_gpio_33_smt : 1;  /* [   17],        r/w,        0x1 */
            uint32_t reg_gpio_33_drv : 2;  /* [19:18],        r/w,        0x0 */
            uint32_t reg_gpio_33_pu  : 1;  /* [   20],        r/w,        0x0 */
            uint32_t reg_gpio_33_pd  : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_31  : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_CFGCTL16;

    /* 0x144 : GPIO_CFGCTL17 */
    union {
        struct
        {
            uint32_t reg_gpio_34_ie  : 1;  /* [    0],        r/w,        0x1 */
            uint32_t reg_gpio_34_smt : 1;  /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_34_drv : 2;  /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_34_pu  : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_34_pd  : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_15   : 10; /* [15: 6],       rsvd,        0x0 */
            uint32_t reg_gpio_35_ie  : 1;  /* [   16],        r/w,        0x1 */
            uint32_t reg_gpio_35_smt : 1;  /* [   17],        r/w,        0x1 */
            uint32_t reg_gpio_35_drv : 2;  /* [19:18],        r/w,        0x0 */
            uint32_t reg_gpio_35_pu  : 1;  /* [   20],        r/w,        0x0 */
            uint32_t reg_gpio_35_pd  : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_31  : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_CFGCTL17;

    /* 0x148 : GPIO_CFGCTL18 */
    union {
        struct
        {
            uint32_t reg_gpio_36_ie  : 1;  /* [    0],        r/w,        0x1 */
            uint32_t reg_gpio_36_smt : 1;  /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_36_drv : 2;  /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_36_pu  : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_36_pd  : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_15   : 10; /* [15: 6],       rsvd,        0x0 */
            uint32_t reg_gpio_37_ie  : 1;  /* [   16],        r/w,        0x1 */
            uint32_t reg_gpio_37_smt : 1;  /* [   17],        r/w,        0x1 */
            uint32_t reg_gpio_37_drv : 2;  /* [19:18],        r/w,        0x0 */
            uint32_t reg_gpio_37_pu  : 1;  /* [   20],        r/w,        0x0 */
            uint32_t reg_gpio_37_pd  : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_31  : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_CFGCTL18;

    /* 0x14c  reserved */
    uint8_t RESERVED0x14c[52];

    /* 0x180 : GPIO_CFGCTL30 */
    union {
        struct
        {
            uint32_t reg_gpio_0_i  : 1; /* [    0],          r,        0x0 */
            uint32_t reg_gpio_1_i  : 1; /* [    1],          r,        0x0 */
            uint32_t reg_gpio_2_i  : 1; /* [    2],          r,        0x0 */
            uint32_t reg_gpio_3_i  : 1; /* [    3],          r,        0x0 */
            uint32_t reg_gpio_4_i  : 1; /* [    4],          r,        0x0 */
            uint32_t reg_gpio_5_i  : 1; /* [    5],          r,        0x0 */
            uint32_t reg_gpio_6_i  : 1; /* [    6],          r,        0x0 */
            uint32_t reg_gpio_7_i  : 1; /* [    7],          r,        0x0 */
            uint32_t reg_gpio_8_i  : 1; /* [    8],          r,        0x0 */
            uint32_t reg_gpio_9_i  : 1; /* [    9],          r,        0x0 */
            uint32_t reg_gpio_10_i : 1; /* [   10],          r,        0x0 */
            uint32_t reg_gpio_11_i : 1; /* [   11],          r,        0x0 */
            uint32_t reg_gpio_12_i : 1; /* [   12],          r,        0x0 */
            uint32_t reg_gpio_13_i : 1; /* [   13],          r,        0x0 */
            uint32_t reg_gpio_14_i : 1; /* [   14],          r,        0x0 */
            uint32_t reg_gpio_15_i : 1; /* [   15],          r,        0x0 */
            uint32_t reg_gpio_16_i : 1; /* [   16],          r,        0x0 */
            uint32_t reg_gpio_17_i : 1; /* [   17],          r,        0x0 */
            uint32_t reg_gpio_18_i : 1; /* [   18],          r,        0x0 */
            uint32_t reg_gpio_19_i : 1; /* [   19],          r,        0x0 */
            uint32_t reg_gpio_20_i : 1; /* [   20],          r,        0x0 */
            uint32_t reg_gpio_21_i : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_22_i : 1; /* [   22],          r,        0x0 */
            uint32_t reg_gpio_23_i : 1; /* [   23],          r,        0x0 */
            uint32_t reg_gpio_24_i : 1; /* [   24],          r,        0x0 */
            uint32_t reg_gpio_25_i : 1; /* [   25],          r,        0x0 */
            uint32_t reg_gpio_26_i : 1; /* [   26],          r,        0x0 */
            uint32_t reg_gpio_27_i : 1; /* [   27],          r,        0x0 */
            uint32_t reg_gpio_28_i : 1; /* [   28],          r,        0x0 */
            uint32_t reg_gpio_29_i : 1; /* [   29],          r,        0x0 */
            uint32_t reg_gpio_30_i : 1; /* [   30],          r,        0x0 */
            uint32_t reg_gpio_31_i : 1; /* [   31],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_CFGCTL30;

    /* 0x184 : GPIO_CFGCTL31 */
    union {
        struct
        {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_CFGCTL31;

    /* 0x188 : GPIO_CFGCTL32 */
    union {
        struct
        {
            uint32_t reg_gpio_0_o  : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_1_o  : 1; /* [    1],        r/w,        0x0 */
            uint32_t reg_gpio_2_o  : 1; /* [    2],        r/w,        0x0 */
            uint32_t reg_gpio_3_o  : 1; /* [    3],        r/w,        0x0 */
            uint32_t reg_gpio_4_o  : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_5_o  : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_6_o  : 1; /* [    6],        r/w,        0x0 */
            uint32_t reg_gpio_7_o  : 1; /* [    7],        r/w,        0x0 */
            uint32_t reg_gpio_8_o  : 1; /* [    8],        r/w,        0x0 */
            uint32_t reg_gpio_9_o  : 1; /* [    9],        r/w,        0x0 */
            uint32_t reg_gpio_10_o : 1; /* [   10],        r/w,        0x0 */
            uint32_t reg_gpio_11_o : 1; /* [   11],        r/w,        0x0 */
            uint32_t reg_gpio_12_o : 1; /* [   12],        r/w,        0x0 */
            uint32_t reg_gpio_13_o : 1; /* [   13],        r/w,        0x0 */
            uint32_t reg_gpio_14_o : 1; /* [   14],        r/w,        0x0 */
            uint32_t reg_gpio_15_o : 1; /* [   15],        r/w,        0x0 */
            uint32_t reg_gpio_16_o : 1; /* [   16],        r/w,        0x0 */
            uint32_t reg_gpio_17_o : 1; /* [   17],        r/w,        0x0 */
            uint32_t reg_gpio_18_o : 1; /* [   18],        r/w,        0x0 */
            uint32_t reg_gpio_19_o : 1; /* [   19],        r/w,        0x0 */
            uint32_t reg_gpio_20_o : 1; /* [   20],        r/w,        0x0 */
            uint32_t reg_gpio_21_o : 1; /* [   21],        r/w,        0x0 */
            uint32_t reg_gpio_22_o : 1; /* [   22],        r/w,        0x0 */
            uint32_t reg_gpio_23_o : 1; /* [   23],        r/w,        0x0 */
            uint32_t reg_gpio_24_o : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_25_o : 1; /* [   25],        r/w,        0x0 */
            uint32_t reg_gpio_26_o : 1; /* [   26],        r/w,        0x0 */
            uint32_t reg_gpio_27_o : 1; /* [   27],        r/w,        0x0 */
            uint32_t reg_gpio_28_o : 1; /* [   28],        r/w,        0x0 */
            uint32_t reg_gpio_29_o : 1; /* [   29],        r/w,        0x0 */
            uint32_t reg_gpio_30_o : 1; /* [   30],        r/w,        0x0 */
            uint32_t reg_gpio_31_o : 1; /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_CFGCTL32;

    /* 0x18C : GPIO_CFGCTL33 */
    union {
        struct
        {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_CFGCTL33;

    /* 0x190 : GPIO_CFGCTL34 */
    union {
        struct
        {
            uint32_t reg_gpio_0_oe  : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_1_oe  : 1; /* [    1],        r/w,        0x0 */
            uint32_t reg_gpio_2_oe  : 1; /* [    2],        r/w,        0x0 */
            uint32_t reg_gpio_3_oe  : 1; /* [    3],        r/w,        0x0 */
            uint32_t reg_gpio_4_oe  : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_5_oe  : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_6_oe  : 1; /* [    6],        r/w,        0x0 */
            uint32_t reg_gpio_7_oe  : 1; /* [    7],        r/w,        0x0 */
            uint32_t reg_gpio_8_oe  : 1; /* [    8],        r/w,        0x0 */
            uint32_t reg_gpio_9_oe  : 1; /* [    9],        r/w,        0x0 */
            uint32_t reg_gpio_10_oe : 1; /* [   10],        r/w,        0x0 */
            uint32_t reg_gpio_11_oe : 1; /* [   11],        r/w,        0x0 */
            uint32_t reg_gpio_12_oe : 1; /* [   12],        r/w,        0x0 */
            uint32_t reg_gpio_13_oe : 1; /* [   13],        r/w,        0x0 */
            uint32_t reg_gpio_14_oe : 1; /* [   14],        r/w,        0x0 */
            uint32_t reg_gpio_15_oe : 1; /* [   15],        r/w,        0x0 */
            uint32_t reg_gpio_16_oe : 1; /* [   16],        r/w,        0x0 */
            uint32_t reg_gpio_17_oe : 1; /* [   17],        r/w,        0x0 */
            uint32_t reg_gpio_18_oe : 1; /* [   18],        r/w,        0x0 */
            uint32_t reg_gpio_19_oe : 1; /* [   19],        r/w,        0x0 */
            uint32_t reg_gpio_20_oe : 1; /* [   20],        r/w,        0x0 */
            uint32_t reg_gpio_21_oe : 1; /* [   21],        r/w,        0x0 */
            uint32_t reg_gpio_22_oe : 1; /* [   22],        r/w,        0x0 */
            uint32_t reg_gpio_23_oe : 1; /* [   23],        r/w,        0x0 */
            uint32_t reg_gpio_24_oe : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_25_oe : 1; /* [   25],        r/w,        0x0 */
            uint32_t reg_gpio_26_oe : 1; /* [   26],        r/w,        0x0 */
            uint32_t reg_gpio_27_oe : 1; /* [   27],        r/w,        0x0 */
            uint32_t reg_gpio_28_oe : 1; /* [   28],        r/w,        0x0 */
            uint32_t reg_gpio_29_oe : 1; /* [   29],        r/w,        0x0 */
            uint32_t reg_gpio_30_oe : 1; /* [   30],        r/w,        0x0 */
            uint32_t reg_gpio_31_oe : 1; /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_CFGCTL34;

    /* 0x194 : GPIO_CFGCTL35 */
    union {
        struct
        {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_CFGCTL35;

    /* 0x198  reserved */
    uint8_t RESERVED0x198[8];

    /* 0x1A0 : GPIO_INT_MASK1 */
    union {
        struct
        {
            uint32_t reg_gpio_int_mask1 : 32; /* [31: 0],        r/w, 0xffffffffL */
        } BF;
        uint32_t WORD;
    } GPIO_INT_MASK1;

    /* 0x1a4  reserved */
    uint8_t RESERVED0x1a4[4];

    /* 0x1A8 : GPIO_INT_STAT1 */
    union {
        struct
        {
            uint32_t gpio_int_stat1 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_INT_STAT1;

