RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl702/std/include/hardware/glb_reg.h
    /* 0x1ac  reserved */
    uint8_t RESERVED0x1ac[4];

    /* 0x1B0 : GPIO_INT_CLR1 */
    union {
        struct
        {
            uint32_t reg_gpio_int_clr1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_INT_CLR1;

    /* 0x1b4  reserved */
    uint8_t RESERVED0x1b4[12];

    /* 0x1C0 : GPIO_INT_MODE_SET1 */
    union {
        struct
        {
            uint32_t reg_gpio_int_mode_set1 : 30; /* [29: 0],        r/w,        0x0 */
            uint32_t reserved_30_31         : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_INT_MODE_SET1;

    /* 0x1C4 : GPIO_INT_MODE_SET2 */
    union {
        struct
        {
            uint32_t reg_gpio_int_mode_set2 : 30; /* [29: 0],        r/w,        0x0 */
            uint32_t reserved_30_31         : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_INT_MODE_SET2;

    /* 0x1C8 : GPIO_INT_MODE_SET3 */
    union {
        struct
        {
            uint32_t reg_gpio_int_mode_set3 : 30; /* [29: 0],        r/w,        0x0 */
            uint32_t reserved_30_31         : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_INT_MODE_SET3;

    /* 0x1CC : GPIO_INT_MODE_SET4 */
    union {
        struct
        {
            uint32_t reg_gpio_int_mode_set4 : 6;  /* [ 5: 0],        r/w,        0x0 */
            uint32_t reserved_6_31          : 26; /* [31: 6],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_INT_MODE_SET4;

    /* 0x1D0 : GPIO_INT2_MASK1 */
    union {
        struct
        {
            uint32_t reg_gpio_int2_mask1 : 32; /* [31: 0],        r/w, 0xffffffffL */
        } BF;
        uint32_t WORD;
    } GPIO_INT2_MASK1;

    /* 0x1D4 : GPIO_INT2_STAT1 */
    union {
        struct
        {
            uint32_t gpio_int2_stat1 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_INT2_STAT1;

    /* 0x1D8 : GPIO_INT2_CLR1 */
    union {
        struct
        {
            uint32_t reg_gpio_int2_clr1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_INT2_CLR1;

    /* 0x1DC : GPIO_INT2_MODE_SET1 */
    union {
        struct
        {
            uint32_t reg_gpio_int2_mode_set1 : 30; /* [29: 0],        r/w,        0x0 */
            uint32_t reserved_30_31          : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_INT2_MODE_SET1;

    /* 0x1E0 : GPIO_INT2_MODE_SET2 */
    union {
        struct
        {
            uint32_t reg_gpio_int2_mode_set2 : 30; /* [29: 0],        r/w,        0x0 */
            uint32_t reserved_30_31          : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_INT2_MODE_SET2;

    /* 0x1E4 : GPIO_INT2_MODE_SET3 */
    union {
        struct
        {
            uint32_t reg_gpio_int2_mode_set3 : 30; /* [29: 0],        r/w,        0x0 */
            uint32_t reserved_30_31          : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_INT2_MODE_SET3;

    /* 0x1E8 : GPIO_INT2_MODE_SET4 */
    union {
        struct
        {
            uint32_t reg_gpio_int2_mode_set4 : 6;  /* [ 5: 0],        r/w,        0x0 */
            uint32_t reserved_6_31           : 26; /* [31: 6],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_INT2_MODE_SET4;

    /* 0x1ec  reserved */
    uint8_t RESERVED0x1ec[20];

    /* 0x200 : dll */
    union {
        struct
        {
            uint32_t dtest_en_dll_refclk : 1; /* [    0],        r/w,        0x0 */
            uint32_t dtest_en_dll_outclk : 1; /* [    1],        r/w,        0x0 */
            uint32_t ten_dll             : 1; /* [    2],        r/w,        0x0 */
            uint32_t dll_clk_mmdiv_en    : 1; /* [    3],        r/w,        0x0 */
            uint32_t dll_clk_288M_en     : 1; /* [    4],        r/w,        0x1 */
            uint32_t dll_clk_144M_en     : 1; /* [    5],        r/w,        0x1 */
            uint32_t dll_clk_96M_en      : 1; /* [    6],        r/w,        0x1 */
            uint32_t dll_clk_57p6M_en    : 1; /* [    7],        r/w,        0x1 */
            uint32_t dll_vctrl_sel       : 3; /* [10: 8],        r/w,        0x4 */
            uint32_t reserved_11         : 1; /* [   11],       rsvd,        0x0 */
            uint32_t dll_prechg_sel      : 1; /* [   12],        r/w,        0x0 */
            uint32_t dll_prechg_reg      : 1; /* [   13],        r/w,        0x1 */
            uint32_t dll_prechg_en       : 1; /* [   14],        r/w,        0x1 */
            uint32_t dll_vctrl_force_en  : 1; /* [   15],        r/w,        0x0 */
            uint32_t dll_post_div        : 4; /* [19:16],        r/w,        0x2 */
            uint32_t dll_delay_sel       : 2; /* [21:20],        r/w,        0x1 */
            uint32_t dll_cp_op_en        : 1; /* [   22],        r/w,        0x1 */
            uint32_t dll_cp_hiz          : 1; /* [   23],        r/w,        0x0 */
            uint32_t reserved_24_27      : 4; /* [27:24],       rsvd,        0x0 */
            uint32_t dll_refclk_sel      : 1; /* [   28],        r/w,        0x0 */
            uint32_t dll_reset           : 1; /* [   29],        r/w,        0x1 */
            uint32_t pu_dll              : 1; /* [   30],        r/w,        0x0 */
            uint32_t ppu_dll             : 1; /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } dll;

    /* 0x204  reserved */
    uint8_t RESERVED0x204[32];

    /* 0x224 : led_driver */
    union {
        struct
        {
            uint32_t led_din_reg          : 1;  /* [    0],        r/w,        0x0 */
            uint32_t led_din_sel          : 1;  /* [    1],        r/w,        0x0 */
            uint32_t led_din_polarity_sel : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reserved_3           : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t leddrv_ibias         : 4;  /* [ 7: 4],        r/w,        0x8 */
            uint32_t ir_rx_gpio_sel       : 4;  /* [11: 8],        r/w,        0x0 */
            uint32_t reserved_12_27       : 16; /* [27:12],       rsvd,        0x0 */
            uint32_t leddrv_out_en        : 2;  /* [29:28],        r/w,        0x3 */
            uint32_t reserved_30          : 1;  /* [   30],       rsvd,        0x0 */
            uint32_t pu_leddrv            : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } led_driver;

    /* 0x228 : usb_xcvr */
    union {
        struct
        {
            uint32_t usb_ldo_vfb      : 3; /* [ 2: 0],        r/w,        0x3 */
            uint32_t pu_usb_ldo       : 1; /* [    3],        r/w,        0x0 */
            uint32_t usb_rout_nmos    : 3; /* [ 6: 4],        r/w,        0x3 */
            uint32_t reserved_7       : 1; /* [    7],       rsvd,        0x0 */
            uint32_t usb_rout_pmos    : 3; /* [10: 8],        r/w,        0x3 */
            uint32_t reserved_11      : 1; /* [   11],       rsvd,        0x0 */
            uint32_t usb_oeb_sel      : 1; /* [   12],         rw,        0x0 */
            uint32_t usb_oeb_reg      : 1; /* [   13],         rw,        0x1 */
            uint32_t usb_oeb          : 1; /* [   14],          r,        0x1 */
            uint32_t reserved_15      : 1; /* [   15],       rsvd,        0x0 */
            uint32_t usb_data_convert : 1; /* [   16],         rw,        0x0 */
            uint32_t reserved_17_19   : 3; /* [19:17],       rsvd,        0x0 */
            uint32_t usb_enum         : 1; /* [   20],        r/w,        0x0 */
            uint32_t usb_spd          : 1; /* [   21],        r/w,        0x1 */
            uint32_t usb_sus          : 1; /* [   22],        r/w,        0x0 */
            uint32_t pu_usb           : 1; /* [   23],        r/w,        0x0 */
            uint32_t usb_bd           : 1; /* [   24],          r,        0x0 */
            uint32_t usb_vim          : 1; /* [   25],          r,        0x0 */
            uint32_t usb_vip          : 1; /* [   26],          r,        0x0 */
            uint32_t usb_rcv          : 1; /* [   27],          r,        0x0 */
            uint32_t reserved_28_31   : 4; /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } usb_xcvr;

